{
  "_meta": {
    "updated": "2026-02-13 09:52 UTC",
    "wiki_base": "https://github.com/OrcaSlicer/OrcaSlicer/wiki/",
    "sha": {
      "Tab.cpp": "37422fd44458",
      "PrintConfig.cpp": "b76d8a5c9f98"
    },
    "total_settings": 689,
    "with_wiki_page": 461
  },
  "settings": {
    "accel_to_decel_enable": {
      "type": "bool",
      "label": "Enable accel_to_decel",
      "category": "Speed",
      "tooltip": "Klipper's max_accel_to_decel will be adjusted automatically.",
      "default": "true",
      "wiki_page": "speed_settings_acceleration"
    },
    "accel_to_decel_factor": {
      "type": "percent",
      "label": "accel_to_decel",
      "category": "Speed",
      "tooltip": "Klipper's max_accel_to_decel will be adjusted to this %% of acceleration.",
      "default": "50",
      "wiki_page": "speed_settings_acceleration"
    },
    "activate_air_filtration": {
      "type": "bool",
      "label": "Activate air filtration",
      "tooltip": "Activate for better air filtration. G-code command: M106 P3 S(0-255)",
      "wiki_page": "material_cooling#activate-air-filtration"
    },
    "activate_chamber_temp_control": {
      "type": "bool",
      "label": "Activate temperature control",
      "tooltip": "Enable this option for automated chamber temperature control. This option activates the emitting of an M191 command before the \"machine_start_gcode\"\n which sets the chamber temperature and waits until it is reached. In addition, it emits an M141 command at the end of the print to turn off the chamber heater, if present.\n\nThis option relies on the firmware supporting the M191 and M141 commands either via macros or natively and is usually used when an active chamber heater is installed.",
      "wiki_page": "material_temperatures#print-chamber-temperature"
    },
    "adaptive_bed_mesh_margin": {
      "type": "float",
      "label": "Mesh margin",
      "sidetext": "mm",
      "tooltip": "This option determines the additional distance by which the adaptive bed mesh area should be expanded in the XY directions.",
      "default": "0",
      "wiki_page": "printer_basic_information_adaptive_bed_mesh#mesh-margin"
    },
    "adaptive_layer_height": {
      "type": "bool",
      "label": "Adaptive layer height",
      "category": "Quality",
      "tooltip": "Enabling this option means the height of every layer except the first will be automatically calculated during slicing according to the slope of the model’s surface.\nNote that this option only takes effect if no prime tower is generated in current plate.",
      "default": "0"
    },
    "adaptive_pressure_advance": {
      "type": "bool",
      "label": "Enable adaptive pressure advance (beta)",
      "tooltip": "With increasing print speeds (and hence increasing volumetric flow through the nozzle) and increasing accelerations, it has been observed that the effective PA value typically decreases. This means that a single PA value is not always 100% optimal for all features and a compromise value is usually used that does not cause too much bulging on features with lower flow speed and accelerations while also not causing gaps on faster features.\n\nThis feature aims to address this limitation by modeling the response of your printer's extrusion system depending on the volumetric flow speed and acceleration it is printing at. Internally, it generates a fitted model that can extrapolate the needed pressure advance for any given volumetric flow speed and acceleration, which is then emitted to the printer depending on the current print conditions.\n\nWhen enabled, the pressure advance value above is overridden. However, a reasonable default value above is strongly recommended to act as a fallback and for when tool changing.\n\n",
      "wiki_page": "material_flow_ratio_and_pressure_advance#enable-adaptive-pressure-advance-beta"
    },
    "adaptive_pressure_advance_bridges": {
      "type": "float",
      "label": "Pressure advance for bridges",
      "tooltip": "Pressure advance value for bridges. Set to 0 to disable.\n\nA lower PA value when printing bridges helps reduce the appearance of slight under extrusion immediately after bridges. This is caused by the pressure drop in the nozzle when printing in the air and a lower PA helps counteract this.",
      "wiki_page": "material_flow_ratio_and_pressure_advance#pressure-advance-for-bridges"
    },
    "adaptive_pressure_advance_model": {
      "type": "string",
      "label": "Adaptive pressure advance measurements (beta)",
      "tooltip": "Add sets of pressure advance (PA) values, the volumetric flow speeds and accelerations they were measured at, separated by a comma. One set of values per line. For example\n0.04,3.96,3000\n0.033,3.96,10000\n0.029,7.91,3000\n0.026,7.91,10000\n\nHow to calibrate:\n1. Run the pressure advance test for at least 3 speeds per acceleration value. It is recommended that the test is run for at least the speed of the external perimeters, the speed of the internal perimeters and the fastest feature print speed in your profile (usually its the sparse or solid infill). Then run them for the same speeds for the slowest and fastest print accelerations, and no faster than the recommended maximum acceleration as given by the Klipper input shaper\n2. Take note of the optimal PA value for each volumetric flow speed and acceleration. You can find the flow number by selecting flow from the color scheme drop down and move the horizontal slider over the PA pattern lines. The number should be visible at the bottom of the page. The ideal PA value should be decreasing the higher the volumetric flow is. If it is not, confirm that your extruder is functioning correctly. The slower and with less acceleration you print, the larger the range of acceptable PA values. If no difference is visible, use the PA value from the faster test\n3. Enter the triplets of PA values, Flow and Accelerations in the text box here and save your filament profile"
    },
    "adaptive_pressure_advance_overhangs": {
      "type": "bool",
      "label": "Enable adaptive pressure advance for overhangs (beta)",
      "tooltip": "Enable adaptive PA for overhangs as well as when flow changes within the same feature. This is an experimental option, as if the PA profile is not set accurately, it will cause uniformity issues on the external surfaces before and after overhangs.\n",
      "wiki_page": "material_flow_ratio_and_pressure_advance#enable-adaptive-pressure-advance-for-overhangs-beta"
    },
    "additional_cooling_fan_speed": {
      "type": "int",
      "label": "Fan speed",
      "tooltip": "Speed of auxiliary part cooling fan. Auxiliary fan will run at this speed during printing except the first several layers which is defined by no cooling layers.\nPlease enable auxiliary_fan in printer settings to use this feature. G-code command: M106 P2 S(0-255)",
      "wiki_page": "material_cooling#auxiliary-part-cooling-fan"
    },
    "align_infill_direction_to_model": {
      "type": "bool",
      "label": "Align infill direction to model",
      "category": "Strength",
      "tooltip": "Aligns infill and surface fill directions to follow the model's orientation on the build plate. When enabled, fill directions rotate with the model to maintain optimal strength characteristics.",
      "default": "false",
      "wiki_page": "strength_settings_advanced#align-infill-direction-to-model"
    },
    "align_xy": {
      "type": "point",
      "label": "Align XY",
      "tooltip": "Align the model to the given point."
    },
    "allow_multicolor_oneplate": {
      "type": "bool",
      "label": "Allow multiple colors on one plate",
      "tooltip": "If enabled, Arrange will allow multiple colors on one plate.",
      "default": "true"
    },
    "allow_newer_file": {
      "type": "bool",
      "label": "Allow 3MF with newer version to be sliced",
      "tooltip": "Allow 3MF with newer version to be sliced.",
      "default": "false"
    },
    "allow_rotations": {
      "type": "bool",
      "label": "Allow rotation when arranging",
      "tooltip": "If enabled, Arrange will allow rotation when placing objects.",
      "default": "true"
    },
    "alternate_extra_wall": {
      "type": "bool",
      "label": "Alternate extra wall",
      "category": "Strength",
      "tooltip": "This setting adds an extra wall to every other layer. This way the infill gets wedged vertically between the walls, resulting in stronger prints.\n\nWhen this option is enabled, the ensure vertical shell thickness option needs to be disabled.\n\nUsing lightning infill together with this option is not recommended as there is limited infill to anchor the extra perimeters to.",
      "default": "false",
      "wiki_page": "strength_settings_walls#alternate-extra-wall"
    },
    "arrange": {
      "type": "int",
      "label": "Arrange Options",
      "tooltip": "Arrange options: 0-disable, 1-enable, others-auto",
      "default": "0"
    },
    "assemble": {
      "type": "bool",
      "label": "Assemble",
      "tooltip": "Arrange the supplied models in a plate and merge them in a single model in order to perform actions once.",
      "default": "false"
    },
    "autosave": {
      "type": "string",
      "label": "Autosave",
      "tooltip": "Automatically export current configuration to the specified file."
    },
    "auxiliary_fan": {
      "type": "bool",
      "label": "Auxiliary part cooling fan",
      "tooltip": "Enable this option if machine has auxiliary part cooling fan. G-code command: M106 P2 S(0-255).",
      "default": "false",
      "wiki_page": "printer_basic_information_accessory#auxiliary-part-cooling-fan"
    },
    "avoid_extrusion_cali_region": {
      "type": "bool",
      "label": "Avoid extrusion calibrate region when arranging",
      "tooltip": "If enabled, Arrange will avoid extrusion calibrate region when placing objects.",
      "default": "false"
    },
    "bbl_calib_mark_logo": {
      "type": "bool",
      "label": "Show auto-calibration marks",
      "tooltip": "",
      "default": "true"
    },
    "bbl_use_printhost": {
      "type": "bool",
      "label": "Use 3rd-party print host",
      "tooltip": "Allow controlling BambuLab's printer through 3rd party print hosts.",
      "default": "false",
      "wiki_page": "printer_basic_information_advanced#use-3rd-party-print-host"
    },
    "bed_custom_model": {
      "type": "string",
      "label": "Bed custom model"
    },
    "bed_custom_texture": {
      "type": "string",
      "label": "Bed custom texture"
    },
    "bed_exclude_area": {
      "type": "points",
      "label": "Bed exclude area",
      "tooltip": "Unprintable area in XY plane. For example, X1 Series printers use the front left corner to cut filament during filament change. The area is expressed as polygon by points in following format: \"XxY, XxY, ...\""
    },
    "bed_mesh_max": {
      "type": "point",
      "label": "Bed mesh max",
      "sidetext": "mm",
      "tooltip": "This option sets the max point for the allowed bed mesh area. Due to the probe's XY offset, most printers are unable to probe the entire bed. To ensure the probe point does not go outside the bed area, the minimum and maximum points of the bed mesh should be set appropriately. OrcaSlicer ensures that adaptive_bed_mesh_min/adaptive_bed_mesh_max values do not exceed these min/max points. This information can usually be obtained from your printer manufacturer. The default setting is (99999, 99999), which means there are no limits, thus allowing probing across the entire bed.",
      "wiki_page": "printer_basic_information_adaptive_bed_mesh#bed-mesh"
    },
    "bed_mesh_min": {
      "type": "point",
      "label": "Bed mesh min",
      "sidetext": "mm",
      "tooltip": "This option sets the min point for the allowed bed mesh area. Due to the probe's XY offset, most printers are unable to probe the entire bed. To ensure the probe point does not go outside the bed area, the minimum and maximum points of the bed mesh should be set appropriately. OrcaSlicer ensures that adaptive_bed_mesh_min/adaptive_bed_mesh_max values do not exceed these min/max points. This information can usually be obtained from your printer manufacturer. The default setting is (-99999, -99999), which means there are no limits, thus allowing probing across the entire bed.",
      "wiki_page": "printer_basic_information_adaptive_bed_mesh#bed-mesh"
    },
    "bed_mesh_probe_distance": {
      "type": "point",
      "label": "Probe point distance",
      "sidetext": "mm",
      "tooltip": "This option sets the preferred distance between probe points (grid size) for the X and Y directions, with the default being 50mm for both X and Y.",
      "wiki_page": "printer_basic_information_adaptive_bed_mesh#probe-point-distance"
    },
    "bed_temperature": {
      "wiki_page": "material_temperatures#bed"
    },
    "bed_temperature_formula": {
      "type": "enum",
      "label": "Bed temperature type",
      "tooltip": "This option determines how the bed temperature is set during slicing: based on the temperature of the first filament or the highest temperature of the printed filaments.",
      "wiki_page": "printer_basic_information_advanced#bed-temperature-type"
    },
    "before_layer_change_gcode": {
      "type": "string",
      "label": "Before layer change G-code",
      "tooltip": "This G-code is inserted at every layer change before the Z lift."
    },
    "best_object_pos": {
      "type": "point",
      "label": "Best object position",
      "tooltip": "Best auto arranging position in range [0,1] w.r.t. bed shape.",
      "wiki_page": "printer_basic_information_printable_space#best-object-position"
    },
    "bottom_shell_layers": {
      "type": "int",
      "label": "Bottom shell layers",
      "full_label": "Bottom shell layers",
      "category": "Strength",
      "sidetext": "layers",
      "tooltip": "This is the number of solid layers of bottom shell, including the bottom surface layer. When the thickness calculated by this value is thinner than bottom shell thickness, the bottom shell layers will be increased.",
      "default": "3",
      "wiki_page": "strength_settings_top_bottom_shells#shell-layers"
    },
    "bottom_shell_thickness": {
      "type": "float",
      "label": "Bottom shell thickness",
      "full_label": "Bottom shell thickness",
      "category": "Strength",
      "sidetext": "mm",
      "tooltip": "The number of bottom solid layers is increased when slicing if the thickness calculated by bottom shell layers is thinner than this value. This can avoid having too thin shell when layer height is small. 0 means that this setting is disabled and thickness of bottom shell is absolutely determined by bottom shell layers.",
      "default": "0.0",
      "wiki_page": "strength_settings_top_bottom_shells#shell-thickness"
    },
    "bottom_solid_infill_flow_ratio": {
      "type": "float",
      "label": "Bottom surface flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for bottom solid infill.\n\nThe actual bottom solid infill flow used is calculated by multiplying this value with the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "bottom_surface_density": {
      "type": "percent",
      "label": "Bottom surface density",
      "category": "Strength",
      "tooltip": "Density of the bottom surface layer. Intended for aesthetic or functional purposes, not to fix issues such as over-extrusion.\nWARNING: Lowering this value may negatively affect bed adhesion.",
      "default": "100",
      "wiki_page": "strength_settings_top_bottom_shells#surface-density"
    },
    "bottom_surface_pattern": {
      "type": "enum",
      "label": "Bottom surface pattern",
      "category": "Strength",
      "tooltip": "Line pattern of bottom surface infill, not bridge infill.",
      "wiki_page": "strength_settings_top_bottom_shells#surface-pattern"
    },
    "bridge_acceleration": {
      "type": "coFloatOrPercent",
      "label": "Bridge",
      "category": "Speed",
      "sidetext": "mm/s² or %",
      "tooltip": "Acceleration of bridges. If the value is expressed as a percentage (e.g. 50%), it will be calculated based on the outer wall acceleration.",
      "wiki_page": "speed_settings_acceleration#bridge"
    },
    "bridge_angle": {
      "type": "float",
      "label": "External bridge infill direction",
      "category": "Strength",
      "tooltip": "Bridging angle override. If left to zero, the bridging angle will be calculated automatically. Otherwise the provided angle will be used for external bridges. Use 180° for zero angle.",
      "default": "0.0",
      "wiki_page": "strength_settings_advanced#bridge-infill-direction"
    },
    "bridge_density": {
      "type": "percent",
      "label": "External bridge density",
      "category": "Strength",
      "tooltip": "Controls the density (spacing) of external bridge lines. Default is 100%.\n\nLower density external bridges can help improve reliability as there is more space for air to circulate around the extruded bridge, improving its cooling speed. Minimum is 10%.\n\nHigher densities can produce smoother bridge surfaces, as overlapping lines provide additional support during printing. Maximum is 120%.\nNote: Bridge density that is too high can cause warping or overextrusion.",
      "default": "100",
      "wiki_page": "quality_settings_bridging#bridge-density"
    },
    "bridge_flow": {
      "type": "float",
      "label": "Bridge flow ratio",
      "category": "Quality",
      "tooltip": "Decrease this value slightly (for example 0.9) to reduce the amount of material for bridge, to improve sag.\n\nThe actual bridge flow used is calculated by multiplying this value with the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_bridging#flow-ratio"
    },
    "bridge_no_support": {
      "type": "bool",
      "label": "Don't support bridges",
      "category": "Support",
      "tooltip": "Don't support the whole bridge area which make support very large. Bridges can usually be printed directly without support if not very long.",
      "default": "false",
      "wiki_page": "support_settings_advanced#dont-support-bridges"
    },
    "bridge_speed": {
      "type": "float",
      "label": "External",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of the externally visible bridge extrusions.\n\nIn addition, if Slow down for curled perimeters is disabled or Classic overhang mode is enabled, it will be the print speed of overhang walls that are supported by less than 13%, whether they are part of a bridge or an overhang.",
      "default": "25",
      "wiki_page": "speed_settings_other_layers_speed#bridge"
    },
    "brim_ears": {
      "type": "bool",
      "label": "Brim ears",
      "category": "Support",
      "tooltip": "Only draw brim over the sharp edges of the model.",
      "default": "false"
    },
    "brim_ears_detection_length": {
      "type": "float",
      "label": "Brim ear detection radius",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "The geometry will be decimated before detecting sharp angles. This parameter indicates the minimum length of the deviation for the decimation.\n0 to deactivate.",
      "default": "1",
      "wiki_page": "others_settings_brim#ear-detection-radius"
    },
    "brim_ears_max_angle": {
      "type": "float",
      "label": "Brim ear max angle",
      "category": "Support",
      "tooltip": "Maximum angle to let a brim ear appear.\nIf set to 0, no brim will be created.\nIf set to ~180, brim will be created on everything but straight sections.",
      "default": "125",
      "wiki_page": "others_settings_brim#ear-max-angle"
    },
    "brim_object_gap": {
      "type": "float",
      "label": "Brim-object gap",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "A gap between innermost brim line and object can make brim be removed more easily.",
      "default": "0.0",
      "wiki_page": "others_settings_brim#brim-object-gap"
    },
    "brim_type": {
      "type": "enum",
      "label": "Brim type",
      "category": "Support",
      "tooltip": "This controls the generation of the brim at outer and/or inner side of models. Auto means the brim width is analyzed and calculated automatically.",
      "wiki_page": "others_settings_brim#type"
    },
    "brim_use_efc_outline": {
      "type": "bool",
      "label": "Brim follows compensated outline",
      "category": "Support",
      "tooltip": "When enabled, the brim is aligned with the first-layer perimeter geometry after Elephant Foot Compensation is applied.\nThis option is intended for cases where Elephant Foot Compensation significantly alters the first-layer footprint.\n\nIf your current setup already works well, enabling it may be unnecessary and can cause the brim to fuse with upper layers.",
      "default": "false",
      "wiki_page": "others_settings_brim#brim-use-efc-outline"
    },
    "brim_width": {
      "type": "float",
      "label": "Brim width",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Distance from model to the outermost brim line.",
      "default": "0.0",
      "wiki_page": "others_settings_brim#width"
    },
    "center": {
      "type": "point",
      "label": "Center",
      "tooltip": "Center the print around the given center."
    },
    "chamber_temperature": {
      "type": "int",
      "label": "Chamber temperature",
      "full_label": "Chamber temperature",
      "tooltip": "For high-temperature materials like ABS, ASA, PC, and PA, a higher chamber temperature can help suppress or reduce warping and potentially lead to higher interlayer bonding strength. However, at the same time, a higher chamber temperature will reduce the efficiency of air filtration for ABS and ASA.\n\nFor PLA, PETG, TPU, PVA, and other low-temperature materials, this option should be disabled (set to 0) as the chamber temperature should be low to avoid extruder clogging caused by material softening at the heat break.\n\nIf enabled, this parameter also sets a G-code variable named chamber_temperature, which can be used to pass the desired chamber temperature to your print start macro, or a heat soak macro like this: PRINT_START (other variables) CHAMBER_TEMP=[chamber_temperature]. This may be useful if your printer does not support M141/M191 commands, or if you desire to handle heat soaking in the print start macro if no active chamber heater is installed.",
      "wiki_page": "material_temperatures#print-chamber-temperature"
    },
    "change_extrusion_role_gcode": {
      "type": "string",
      "label": "Change extrusion role G-code",
      "tooltip": "This G-code is inserted when the extrusion role is changed."
    },
    "change_filament_gcode": {
      "type": "string",
      "label": "Change filament G-code",
      "tooltip": "This G-code is inserted when filament is changed, including T commands to trigger tool change."
    },
    "clone_objects": {
      "type": "int",
      "label": "Clone Objects",
      "tooltip": "Clone objects in the load list."
    },
    "close_fan_the_first_x_layers": {
      "type": "int",
      "label": "No cooling for the first",
      "sidetext": "layers",
      "tooltip": "Turn off all cooling fans for the first few layers. This can be used to improve build plate adhesion.",
      "wiki_page": "material_cooling#no-cooling-for-the-first"
    },
    "compatible_printers": {
      "type": "string",
      "label": "Select printers"
    },
    "compatible_printers_condition": {
      "type": "string",
      "label": "Condition",
      "tooltip": "A boolean expression using the configuration values of an active printer profile. If this expression evaluates to true, this profile is considered compatible with the active printer profile."
    },
    "compatible_prints": {
      "type": "string",
      "label": "Select profiles"
    },
    "compatible_prints_condition": {
      "type": "string",
      "label": "Condition",
      "tooltip": "A boolean expression using the configuration values of an active print profile. If this expression evaluates to true, this profile is considered compatible with the active print profile."
    },
    "complete_print_exhaust_fan_speed": {
      "type": "int",
      "label": "Fan speed",
      "tooltip": "Speed of exhaust fan after printing completes."
    },
    "config_compatibility": {
      "type": "enum",
      "label": "Forward-compatibility rule when loading configurations from config files and project files (3MF, AMF).",
      "tooltip": "This version of OrcaSlicer may not understand configurations produced by the newest OrcaSlicer versions. For example, newer OrcaSlicer may extend the list of supported firmware flavors. One may decide to bail out or to substitute an unknown value with a default silently or verbosely."
    },
    "convert_unit": {
      "type": "bool",
      "label": "Convert Unit",
      "tooltip": "Convert the units of model.",
      "default": "false"
    },
    "cool_plate_temp": {
      "type": "int",
      "label": "Other layers",
      "full_label": "Bed temperature",
      "tooltip": "Bed temperature for layers except the initial one. A value of 0 means the filament does not support printing on the Cool Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "cool_plate_temp_initial_layer": {
      "type": "int",
      "label": "Initial layer",
      "full_label": "Initial layer bed temperature",
      "tooltip": "Bed temperature of the initial layer. A value of 0 means the filament does not support printing on the Cool Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "cooling_tube_length": {
      "type": "float",
      "label": "Cooling tube length",
      "sidetext": "mm",
      "tooltip": "Length of the cooling tube to limit space for cooling moves inside it.",
      "default": "5.0",
      "wiki_page": "printer_multimaterial_semm_parameters#cooling-tube-length"
    },
    "cooling_tube_retraction": {
      "type": "float",
      "label": "Cooling tube position",
      "sidetext": "mm",
      "tooltip": "Distance of the center-point of the cooling tube from the extruder tip.",
      "default": "91.5",
      "wiki_page": "printer_multimaterial_semm_parameters#cooling-tube-position"
    },
    "copy": {
      "type": "int",
      "label": "Copy",
      "tooltip": "Duplicate copies of model.",
      "default": "1"
    },
    "counterbore_hole_bridging": {
      "type": "enum",
      "label": "Bridge counterbore holes",
      "category": "Quality",
      "tooltip": "This option creates bridges for counterbore holes, allowing them to be printed without support. Available modes include:\n1. None: No bridge is created\n2. Partially Bridged: Only a part of the unsupported area will be bridged\n3. Sacrificial Layer: A full sacrificial bridge layer is created",
      "wiki_page": "quality_settings_bridging#bridge-counterbore-hole"
    },
    "curr_bed_type": {
      "type": "enum",
      "label": "Bed type",
      "tooltip": "Bed types supported by the printer."
    },
    "current_extruder": {
      "type": "int",
      "label": "Current extruder",
      "tooltip": "Zero-based index of currently used extruder."
    },
    "current_object_idx": {
      "type": "int",
      "label": "Current object index",
      "tooltip": "Specific for sequential printing. Zero-based index of currently printed object."
    },
    "cut": {
      "type": "float",
      "label": "Cut",
      "tooltip": "Cut model at the given Z.",
      "default": "0"
    },
    "cut_grid": {
      "type": "float",
      "label": "Cut",
      "tooltip": "Cut model in the XY plane into tiles of the specified max size."
    },
    "cut_x": {
      "type": "float",
      "label": "Cut",
      "tooltip": "Cut model at the given X.",
      "default": "0"
    },
    "cut_y": {
      "type": "float",
      "label": "Cut",
      "tooltip": "Cut model at the given Y.",
      "default": "0"
    },
    "datadir": {
      "type": "string",
      "label": "Data directory",
      "tooltip": "Load and store settings at the given directory. This is useful for maintaining different profiles or including configurations from a network storage."
    },
    "day": {
      "type": "int",
      "label": "Day"
    },
    "debug": {
      "type": "int",
      "label": "Debug level",
      "tooltip": "Sets debug logging level. 0:fatal, 1:error, 2:warning, 3:info, 4:debug, 5:trace\n",
      "default": "1"
    },
    "default_acceleration": {
      "type": "float",
      "label": "Normal printing",
      "category": "Speed",
      "tooltip": "The default acceleration of both normal printing and travel except initial layer.",
      "default": "500.0",
      "wiki_page": "speed_settings_acceleration#normal-printing"
    },
    "default_bed_type": {
      "type": "string",
      "label": "Default bed type",
      "tooltip": "Default bed type for the printer (supports both numeric and string format)."
    },
    "default_filament_colour": {
      "type": "string",
      "label": "Default color",
      "tooltip": "Default filament color.\nRight click to reset value to system default.",
      "wiki_page": "material_basic_information#default-color"
    },
    "default_filament_profile": {
      "type": "string",
      "label": "Default filament profile",
      "tooltip": "Default filament profile when switching to this machine profile."
    },
    "default_jerk": {
      "type": "float",
      "label": "Default",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Default jerk.",
      "default": "0",
      "wiki_page": "speed_settings_jerk_xy#default"
    },
    "default_junction_deviation": {
      "type": "float",
      "label": "Junction Deviation",
      "category": "Speed",
      "sidetext": "mm",
      "tooltip": "Marlin Firmware Junction Deviation (replaces the traditional XY Jerk setting).",
      "default": "0",
      "wiki_page": "speed_settings_jerk_xy#junction-deviation"
    },
    "default_print_profile": {
      "type": "string",
      "label": "Default process profile",
      "tooltip": "Default process profile when switching to this machine profile."
    },
    "deretraction_speed": {
      "type": "float",
      "label": "De-retraction Speed",
      "full_label": "De-retraction Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed for reloading filament into the nozzle. Zero means same speed of retraction.",
      "wiki_page": "printer_extruder_retraction#deretraction-speed"
    },
    "detect_narrow_internal_solid_infill": {
      "type": "bool",
      "label": "Detect narrow internal solid infill",
      "category": "Strength",
      "tooltip": "This option will auto-detect narrow internal solid infill areas. If enabled, the concentric pattern will be used for the area to speed up printing. Otherwise, the rectilinear pattern will be used by default.",
      "default": "true",
      "wiki_page": "strength_settings_advanced#detect-narrow-internal-solid-infill"
    },
    "detect_overhang_wall": {
      "type": "bool",
      "label": "Detect overhang wall",
      "category": "Quality",
      "tooltip": "Detect the overhang percentage relative to line width and use different speed to print. For 100%% overhang, bridge speed is used.",
      "default": "true",
      "wiki_page": "quality_settings_overhangs#detect-overhang-wall"
    },
    "detect_thin_wall": {
      "type": "bool",
      "label": "Detect thin wall",
      "category": "Strength",
      "tooltip": "Detect thin wall which can't contain two line width. And use single line to print. Maybe printed not very well, because it's not closed loop.",
      "default": "false",
      "wiki_page": "strength_settings_walls#detect-thin-wall"
    },
    "disable_m73": {
      "type": "bool",
      "label": "Disable set remaining print time",
      "tooltip": "Disable generating of the M73: Set remaining print time in the final G-code.",
      "default": "false",
      "wiki_page": "printer_basic_information_advanced#disable-set-remaining-print-time"
    },
    "dont_filter_internal_bridges": {
      "type": "enum",
      "label": "Filter out small internal bridges",
      "category": "Quality",
      "tooltip": "This option can help reduce pillowing on top surfaces in heavily slanted or curved models.\nBy default, small internal bridges are filtered out and the internal solid infill is printed directly over the sparse infill. This works well in most cases, speeding up printing without too much compromise on top surface quality.\nHowever, in heavily slanted or curved models, especially where too low a sparse infill density is used, this may result in curling of the unsupported solid infill, causing pillowing.\nEnabling limited filtering or no filtering will print internal bridge layer over slightly unsupported internal solid infill. The options below control the sensitivity of the filtering, i.e. they control where internal bridges are created:\n1. Filter - enables this option. This is the default behavior and works well in most cases\n2. Limited filtering - creates internal bridges on heavily slanted surfaces while avoiding unnecessary bridges. This works well for most difficult models\n3. No filtering - creates internal bridges on every potential internal overhang. This option is useful for heavily slanted top surface models; however, in most cases, it creates too many unnecessary bridges",
      "wiki_page": "quality_settings_bridging#filter-out-small-internal-bridges"
    },
    "dont_slow_down_outer_wall": {
      "type": "bool",
      "label": "Don't slow down outer walls",
      "tooltip": "If enabled, this setting will ensure external perimeters are not slowed down to meet the minimum layer time. This is particularly helpful in the below scenarios:\n1. To avoid changes in shine when printing glossy filaments\n2. To avoid changes in external wall speed which may create slight wall artifacts that appear like Z banding\n3. To avoid printing at speeds which cause VFAs (fine artifacts) on the external walls",
      "wiki_page": "material_cooling#dont-slow-down-outer-walls"
    },
    "downward_check": {
      "type": "bool",
      "label": "Downward machines check",
      "tooltip": "If enabled, check whether current machine downward compatible with the machines in the list.",
      "default": "false"
    },
    "downward_settings": {
      "type": "string",
      "label": "downward machines settings",
      "tooltip": "The machine settings list needs to do downward checking."
    },
    "draft_shield": {
      "type": "enum",
      "label": "Draft shield",
      "tooltip": "A draft shield is useful to protect an ABS or ASA print from warping and detaching from print bed due to wind draft. It is usually needed only with open frame printers, i.e. without an enclosure.\n\nEnabled = skirt is as tall as the highest printed object. Otherwise 'Skirt height' is used.\nNote: With the draft shield active, the skirt will be printed at skirt distance from the object. Therefore, if brims are active it may intersect with them. To avoid this, increase the skirt distance value.\n",
      "wiki_page": "others_settings_skirt#shield"
    },
    "duplicate_grid": {
      "type": "point",
      "label": "Duplicate by grid",
      "tooltip": "Multiply copies by creating a grid."
    },
    "during_print_exhaust_fan_speed": {
      "type": "int",
      "label": "Fan speed",
      "tooltip": "Speed of exhaust fan during printing. This speed will override the speed in filament custom G-code."
    },
    "e_position": {
      "type": "float",
      "label": "Absolute E position",
      "tooltip": "Current position of the extruder axis. Only used with absolute extruder addressing."
    },
    "e_restart_extra": {
      "type": "float",
      "label": "Extra de-retraction",
      "tooltip": "Currently planned extra extruder priming after de-retraction."
    },
    "e_retracted": {
      "type": "float",
      "label": "Retraction",
      "tooltip": "Retraction state at the beginning of the custom G-code block. If the custom G-code moves the extruder axis, it should write to this variable so OrcaSlicer de-retracts correctly when it gets control back."
    },
    "elefant_foot_compensation": {
      "type": "float",
      "label": "Elephant foot compensation",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Shrinks the initial layer on build plate to compensate for elephant foot effect.",
      "default": "0.0",
      "wiki_page": "quality_settings_precision#elephant-foot-compensation"
    },
    "elefant_foot_compensation_layers": {
      "type": "int",
      "label": "Elephant foot compensation layers",
      "category": "Quality",
      "sidetext": "layers",
      "tooltip": "The number of layers on which the elephant foot compensation will be active. The first layer will be shrunk by the elephant foot compensation value, then the next layers will be linearly shrunk less, up to the layer indicated by this value.",
      "default": "1",
      "wiki_page": "quality_settings_precision#elephant-foot-compensation"
    },
    "emit_machine_limits_to_gcode": {
      "type": "bool",
      "label": "Emit limits to G-code",
      "category": "Machine limits",
      "tooltip": "If enabled, the machine limits will be emitted to G-code file.\nThis option will be ignored if the G-code flavor is set to Klipper.",
      "default": "true",
      "wiki_page": "printer_motion_ability#emit-limits-to-g-code"
    },
    "enable_arc_fitting": {
      "type": "bool",
      "label": "Arc fitting",
      "tooltip": "Enable this to get a G-code file which has G2 and G3 moves. The fitting tolerance is same as the resolution.\n\nNote: For Klipper machines, this option is recommended to be disabled. Klipper does not benefit from arc commands as these are split again into line segments by the firmware. This results in a reduction in surface quality as line segments are converted to arcs by the slicer and then back to line segments by the firmware.",
      "default": "0",
      "wiki_page": "quality_settings_precision#arc-fitting"
    },
    "enable_extra_bridge_layer": {
      "type": "enum",
      "label": "Extra bridge layers (beta)",
      "category": "Quality",
      "tooltip": "This option enables the generation of an extra bridge layer over internal and/or external bridges.\n\nExtra bridge layers help improve bridge appearance and reliability, as the solid infill is better supported. This is especially useful in fast printers, where the bridge and solid infill speeds vary greatly. The extra bridge layer results in reduced pillowing on top surfaces, as well as reduced separation of the external bridge layer from its surrounding perimeters.\n\nIt is generally recommended to set this to at least 'External bridge only', unless specific issues with the sliced model are found.\n\nOptions:\n1. Disabled - does not generate second bridge layers. This is the default and is set for compatibility purposes\n2. External bridge only - generates second bridge layers for external-facing bridges only. Please note that small bridges that are shorter or narrower than the set number of perimeters will be skipped as they would not benefit from a second bridge layer. If generated, the second bridge layer will be extruded parallel to the first bridge layer to reinforce the bridge strength\n3. Internal bridge only - generates second bridge layers for internal bridges over sparse infill only. Please note that the internal bridges count towards the top shell layer count of your model. The second internal bridge layer will be extruded as close to perpendicular to the first as possible. If multiple regions in the same island, with varying bridge angles are present, the last region of that island will be selected as the angle reference\n4. Apply to all - generates second bridge layers for both internal and external-facing bridges\n",
      "wiki_page": "quality_settings_bridging#extra-bridge-layers"
    },
    "enable_filament_ramming": {
      "type": "bool",
      "label": "Enable filament ramming",
      "tooltip": "Enable filament ramming",
      "default": "true",
      "wiki_page": "printer_multimaterial_wipe_tower#enable-filament-ramming"
    },
    "enable_overhang_bridge_fan": {
      "type": "bool",
      "label": "Force cooling for overhangs and bridges",
      "tooltip": "Enable this option to allow adjustment of the part cooling fan speed for specifically for overhangs, internal and external bridges. Setting the fan speed specifically for these features can improve overall print quality and reduce warping.",
      "wiki_page": "material_cooling#force-cooling-for-overhangs-and-bridges"
    },
    "enable_overhang_speed": {
      "type": "bool",
      "label": "Slow down for overhang",
      "category": "Speed",
      "tooltip": "Enable this option to slow printing down for different overhang degree.",
      "wiki_page": "speed_settings_overhang_speed#slow-down-for-overhang"
    },
    "enable_power_loss_recovery": {
      "type": "enum",
      "label": "Power Loss Recovery",
      "tooltip": "Choose how to control power loss recovery. When set to Printer configuration, the slicer will not emit power loss recovery G-code and will leave the printer's configuration unchanged. Applicable to Bambu Lab or Marlin 2 firmware based printers.",
      "wiki_page": "printer_basic_information_advanced#power-loss-recovery"
    },
    "enable_pressure_advance": {
      "type": "bool",
      "label": "Enable pressure advance",
      "tooltip": "Enable pressure advance, auto calibration result will be overwritten once enabled.",
      "wiki_page": "material_flow_ratio_and_pressure_advance#pressure-advance"
    },
    "enable_prime_tower": {
      "type": "bool",
      "label": "Enable",
      "tooltip": "The wiping tower can be used to clean up the residue on the nozzle and stabilize the chamber pressure inside the nozzle, in order to avoid appearance defects when printing objects.",
      "default": "false",
      "wiki_page": "multimaterial_settings_prime_tower"
    },
    "enable_support": {
      "type": "bool",
      "label": "Enable support",
      "category": "Support",
      "tooltip": "Enable support generation.",
      "default": "false",
      "wiki_page": "support_settings_support"
    },
    "enable_timelapse": {
      "type": "bool",
      "label": "Enable timelapse for print",
      "tooltip": "If enabled, this slicing will be considered using timelapse.",
      "default": "false"
    },
    "enable_wrapping_detection": {
      "type": "bool",
      "label": "Enable clumping detection",
      "tooltip": "Enable clumping detection",
      "default": "false"
    },
    "enforce_support_layers": {
      "type": "int",
      "label": "Enforce support for the first",
      "full_label": "Enforce support for the first n layers",
      "category": "Support",
      "sidetext": "layers",
      "tooltip": "Generate support material for the specified number of layers counting from bottom, regardless of whether normal support material is enabled or not and regardless of any angle threshold. This is useful for getting more adhesion of objects having a very thin or poor footprint on the build plate.",
      "default": "0",
      "wiki_page": "support_settings_support"
    },
    "eng_plate_temp": {
      "type": "int",
      "label": "Other layers",
      "full_label": "Bed temperature",
      "tooltip": "Bed temperature for layers except the initial one. A value of 0 means the filament does not support printing on the Engineering Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "eng_plate_temp_initial_layer": {
      "type": "int",
      "label": "Initial layer",
      "full_label": "Initial layer bed temperature",
      "tooltip": "Bed temperature of the initial layer. A value of 0 means the filament does not support printing on the Engineering Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "ensure_on_bed": {
      "type": "bool",
      "label": "Ensure on bed",
      "tooltip": "Lift the object above the bed when it is partially below. Disabled by default.",
      "default": "false"
    },
    "ensure_vertical_shell_thickness": {
      "type": "enum",
      "label": "Ensure vertical shell thickness",
      "category": "Strength",
      "tooltip": "Add solid infill near sloping surfaces to guarantee the vertical shell thickness (top+bottom solid layers)\nNone: No solid infill will be added anywhere. Caution: Use this option carefully if your model has sloped surfaces\nCritical Only: Avoid adding solid infill for walls\nModerate: Add solid infill for heavily sloping surfaces only\nAll: Add solid infill for all suitable sloping surfaces\nDefault value is All.",
      "wiki_page": "strength_settings_advanced#ensure-vertical-shell-thickness"
    },
    "exclude_object": {
      "type": "bool",
      "label": "Exclude objects",
      "tooltip": "Enable this option to add EXCLUDE OBJECT command in G-code.",
      "default": "false",
      "wiki_page": "others_settings_g_code_output#exclude-objects"
    },
    "export_3mf": {
      "type": "string",
      "label": "Export 3MF",
      "tooltip": "Export project as 3MF."
    },
    "export_amf": {
      "type": "bool",
      "label": "Export AMF",
      "tooltip": "Export the model(s) as AMF.",
      "default": "false"
    },
    "export_gcode": {
      "type": "bool",
      "label": "Export G-code",
      "tooltip": "Slice the model and export toolpaths as G-code.",
      "default": "false"
    },
    "export_obj": {
      "type": "bool",
      "label": "Export OBJ",
      "tooltip": "Export the model(s) as OBJ.",
      "default": "false"
    },
    "export_settings": {
      "type": "string",
      "label": "Export Settings",
      "tooltip": "Export settings to a file."
    },
    "export_sla": {
      "type": "bool",
      "label": "Export SLA",
      "tooltip": "Slice the model and export SLA printing layers as PNG.",
      "default": "false"
    },
    "export_slicedata": {
      "type": "string",
      "label": "Export slicing data",
      "tooltip": "Export slicing data to a folder."
    },
    "export_stl": {
      "type": "bool",
      "label": "Export STL",
      "tooltip": "Export the objects as single STL.",
      "default": "false"
    },
    "export_stls": {
      "type": "string",
      "label": "Export multiple STLs",
      "tooltip": "Export the objects as multiple STLs to directory."
    },
    "export_svg": {
      "type": "bool",
      "label": "Export SVG",
      "tooltip": "Slice the model and export solid slices as SVG.",
      "default": "false"
    },
    "extra_loading_move": {
      "type": "float",
      "label": "Extra loading distance",
      "sidetext": "mm",
      "tooltip": "When set to zero, the distance the filament is moved from parking position during load is exactly the same as it was moved back during unload. When positive, it is loaded further, if negative, the loading move is shorter than unloading.",
      "default": "-2.0",
      "wiki_page": "printer_multimaterial_semm_parameters#extra-loading-distance"
    },
    "extra_perimeters_on_overhangs": {
      "type": "bool",
      "label": "Extra perimeters on overhangs",
      "category": "Quality",
      "tooltip": "Create additional perimeter paths over steep overhangs and areas where bridges cannot be anchored.",
      "default": "false",
      "wiki_page": "quality_settings_overhangs#extra-perimeters-on-overhangs"
    },
    "extra_solid_infills": {
      "type": "string",
      "label": "Insert solid layers",
      "category": "Strength",
      "tooltip": "Insert solid infill at specific layers. Use N to insert every Nth layer, N#K to insert K consecutive solid layers every N layers (K is optional, e.g. '5#' equals '5#1'), or a comma-separated list (e.g. 1,7,9) to insert at explicit layers. Layers are 1-based.",
      "wiki_page": "strength_settings_infill#extra-solid-infill"
    },
    "extruded_volume": {
      "type": "float",
      "label": "Volume per extruder",
      "tooltip": "Total filament volume extruded per extruder during the entire print."
    },
    "extruded_volume_total": {
      "type": "float",
      "label": "Total volume",
      "tooltip": "Total volume of filament used during the entire print."
    },
    "extruded_weight": {
      "type": "float",
      "label": "Weight per extruder",
      "tooltip": "Weight per extruder extruded during the entire print. Calculated from filament_density value in Filament Settings."
    },
    "extruded_weight_total": {
      "type": "float",
      "label": "Total weight",
      "tooltip": "Total weight of the print. Calculated from filament_density value in Filament Settings."
    },
    "extruder": {
      "type": "int",
      "label": "Extruder",
      "category": "Extruders",
      "tooltip": "The extruder to use (unless more specific extruder settings are specified). This value overrides perimeter and infill extruders, but not the support extruders."
    },
    "extruder_clearance_height_to_lid": {
      "type": "float",
      "label": "Height to lid",
      "sidetext": "mm",
      "tooltip": "Distance of the nozzle tip to the lid. Used for collision avoidance in by-object printing.",
      "default": "120",
      "wiki_page": "printer_basic_information_extruder_clearance#height-to-lid"
    },
    "extruder_clearance_height_to_rod": {
      "type": "float",
      "label": "Height to rod",
      "sidetext": "mm",
      "tooltip": "Distance of the nozzle tip to the lower rod. Used for collision avoidance in by-object printing.",
      "default": "40",
      "wiki_page": "printer_basic_information_extruder_clearance#height-to-rod"
    },
    "extruder_clearance_radius": {
      "type": "float",
      "label": "Radius",
      "sidetext": "mm",
      "tooltip": "Clearance radius around extruder. Used for collision avoidance in by-object printing.",
      "default": "40",
      "wiki_page": "printer_basic_information_extruder_clearance#radius"
    },
    "extruder_colour": {
      "type": "string",
      "label": "Extruder Color",
      "tooltip": "Only used as a visual help on UI."
    },
    "extruder_offset": {
      "type": "points",
      "label": "Extruder offset",
      "sidetext": "mm",
      "tooltip": "If your firmware doesn't handle the extruder displacement you need the G-code to take it into account. This option lets you specify the displacement of each extruder with respect to the first one. It expects positive coordinates (they will be subtracted from the XY coordinate).",
      "wiki_page": "printer_extruder_basic_information#extruder-offset-position"
    },
    "extruder_printable_area": {
      "type": "coPointsGroups",
      "label": "Extruder printable area"
    },
    "extruder_printable_height": {
      "type": "float",
      "label": "Extruder printable height",
      "sidetext": "mm",
      "tooltip": "Maximum printable height of this extruder which is limited by mechanism of printer.",
      "wiki_page": "printer_extruder_basic_information#extruder-layer-height-limits"
    },
    "extrusion_rate_smoothing_external_perimeter_only": {
      "type": "bool",
      "label": "Apply only on external features",
      "tooltip": "Applies extrusion rate smoothing only on external perimeters and overhangs. This can help reduce artefacts due to sharp speed transitions on externally visible overhangs without impacting the print speed of features that will not be visible to the user.",
      "default": "false",
      "wiki_page": "speed_settings_advanced"
    },
    "fan_cooling_layer_time": {
      "type": "float",
      "label": "Layer time",
      "sidetext": "s",
      "tooltip": "Part cooling fan will be enabled for layers of which estimated time is shorter than this value. Fan speed is interpolated between the minimum and maximum fan speeds according to layer printing time.",
      "wiki_page": "material_cooling#material-part-cooling-fan"
    },
    "fan_kickstart": {
      "type": "float",
      "label": "Fan kick-start time",
      "sidetext": "s",
      "tooltip": "Emit a max fan speed command for this amount of seconds before reducing to target speed to kick-start the cooling fan.\nThis is useful for fans where a low PWM/power may be insufficient to get the fan started spinning from a stop, or to get the fan up to speed faster.\nSet to 0 to deactivate.",
      "default": "0",
      "wiki_page": "printer_basic_information_cooling_fan#fan-kick-start-time"
    },
    "fan_max_speed": {
      "type": "float",
      "label": "Fan speed",
      "tooltip": "Part cooling fan speed may be increased when auto cooling is enabled. This is the maximum speed for the part cooling fan.",
      "wiki_page": "material_cooling#material-part-cooling-fan"
    },
    "fan_min_speed": {
      "type": "float",
      "label": "Fan speed",
      "tooltip": "Minimum speed for part cooling fan.",
      "wiki_page": "material_cooling#material-part-cooling-fan"
    },
    "fan_speedup_overhangs": {
      "type": "bool",
      "label": "Only overhangs",
      "tooltip": "Will only take into account the delay for the cooling of overhangs.",
      "default": "true",
      "wiki_page": "printer_basic_information_cooling_fan#fan-speed-up-time"
    },
    "fan_speedup_time": {
      "type": "float",
      "label": "Fan speed-up time",
      "sidetext": "s",
      "tooltip": "Start the fan this number of seconds earlier than its target start time (you can use fractional seconds). It assumes infinite acceleration for this time estimation, and will only take into account G1 and G0 moves (arc fitting is unsupported).\nIt won't move fan commands from custom G-code (they act as a sort of 'barrier').\nIt won't move fan commands into the start G-code if the 'only custom start G-code' is activated.\nUse 0 to deactivate.",
      "default": "0",
      "wiki_page": "printer_basic_information_cooling_fan#fan-speed-up-time"
    },
    "filament_adaptive_volumetric_speed": {
      "type": "bool",
      "label": "Adaptive volumetric speed",
      "tooltip": "When enabled, the extrusion flow is limited by the smaller of the fitted value (calculated from line width and layer height) and the user-defined maximum flow. When disabled, only the user-defined maximum flow is applied.",
      "wiki_page": "material_volumetric_speed_limitation#adaptive-volumetric-speed"
    },
    "filament_adhesiveness_category": {
      "type": "int",
      "label": "Adhesiveness Category",
      "tooltip": "Filament category.",
      "wiki_page": "material_basic_information#adhesiveness-category"
    },
    "filament_change_length": {
      "type": "float",
      "label": "Filament ramming length",
      "sidetext": "mm",
      "tooltip": "When changing the extruder, it is recommended to extrude a certain length of filament from the original extruder. This helps minimize nozzle oozing.",
      "wiki_page": "material_basic_information#filament-ramming-length"
    },
    "filament_colour": {
      "type": "string",
      "label": "Color",
      "tooltip": "Only used as a visual help on UI."
    },
    "filament_cooling_final_speed": {
      "type": "float",
      "label": "Speed of the last cooling move",
      "sidetext": "mm/s",
      "tooltip": "Cooling moves are gradually accelerating towards this speed.",
      "wiki_page": "material_multimaterial#speed-of-the-last-cooling-move"
    },
    "filament_cooling_initial_speed": {
      "type": "float",
      "label": "Speed of the first cooling move",
      "sidetext": "mm/s",
      "tooltip": "Cooling moves are gradually accelerating beginning at this speed.",
      "wiki_page": "material_multimaterial#speed-of-the-first-cooling-move"
    },
    "filament_cooling_moves": {
      "type": "int",
      "label": "Number of cooling moves",
      "tooltip": "Filament is cooled by being moved back and forth in the cooling tubes. Specify desired number of these moves.",
      "wiki_page": "material_multimaterial#number-of-cooling-moves"
    },
    "filament_cost": {
      "type": "float",
      "label": "Price",
      "sidetext": "money/kg",
      "tooltip": "Filament price. For statistics only.",
      "wiki_page": "material_basic_information#price"
    },
    "filament_density": {
      "type": "float",
      "label": "Density",
      "tooltip": "Filament density. For statistics only.",
      "wiki_page": "material_basic_information#density"
    },
    "filament_diameter": {
      "type": "float",
      "label": "Diameter",
      "sidetext": "mm",
      "tooltip": "Filament diameter is used to calculate extrusion in G-code, so it is important and should be accurate.",
      "wiki_page": "material_basic_information#diameter"
    },
    "filament_end_gcode": {
      "type": "string",
      "label": "End G-code",
      "tooltip": "End G-code when finishing the printing of this filament."
    },
    "filament_extruder_id": {
      "type": "int",
      "label": "Filament extruder ID",
      "tooltip": "The current extruder ID. The same as current_extruder."
    },
    "filament_flow_ratio": {
      "type": "float",
      "label": "Flow ratio",
      "tooltip": "The material may have volumetric change after switching between molten and crystalline states. This setting changes all extrusion flow of this filament in G-code proportionally. The recommended value range is between 0.95 and 1.05. You may be able to tune this value to get a nice flat surface if there is slight overflow or underflow.",
      "wiki_page": "material_flow_ratio_and_pressure_advance#flow-ratio"
    },
    "filament_flush_temp": {
      "type": "int",
      "label": "Flush temperature",
      "tooltip": "Temperature when flushing filament. 0 indicates the upper bound of the recommended nozzle temperature range."
    },
    "filament_flush_volumetric_speed": {
      "type": "float",
      "label": "Flush volumetric speed",
      "tooltip": "Volumetric speed when flushing filament. 0 indicates the max volumetric speed."
    },
    "filament_ironing_flow": {
      "type": "percent",
      "label": "Ironing flow",
      "category": "Quality",
      "tooltip": "Filament-specific override for ironing flow. This allows you to customize the ironing flow for each filament type. Too high value results in overextrusion on the surface."
    },
    "filament_ironing_inset": {
      "type": "float",
      "label": "Ironing inset",
      "category": "Quality",
      "tooltip": "Filament-specific override for ironing inset. This allows you to customize the distance to keep from the edges when ironing for each filament type."
    },
    "filament_ironing_spacing": {
      "type": "float",
      "label": "Ironing line spacing",
      "category": "Quality",
      "tooltip": "Filament-specific override for ironing line spacing. This allows you to customize the spacing between ironing lines for each filament type."
    },
    "filament_ironing_speed": {
      "type": "float",
      "label": "Ironing speed",
      "category": "Speed",
      "tooltip": "Filament-specific override for ironing speed. This allows you to customize the print speed of ironing lines for each filament type."
    },
    "filament_is_support": {
      "type": "bool",
      "label": "Support material",
      "tooltip": "Support material is commonly used to print supports and support interfaces.",
      "wiki_page": "material_basic_information#support-material"
    },
    "filament_loading_speed": {
      "type": "float",
      "label": "Loading speed",
      "sidetext": "mm/s",
      "tooltip": "Speed used for loading the filament on the wipe tower.",
      "wiki_page": "material_multimaterial#loading-speed"
    },
    "filament_loading_speed_start": {
      "type": "float",
      "label": "Loading speed at the start",
      "sidetext": "mm/s",
      "tooltip": "Speed used at the very beginning of loading phase.",
      "wiki_page": "material_multimaterial#loading-speed-at-the-start"
    },
    "filament_map": {
      "type": "int",
      "label": "Filament map to extruder",
      "tooltip": "Filament map to extruder."
    },
    "filament_max_volumetric_speed": {
      "type": "float",
      "label": "Max volumetric speed",
      "tooltip": "This setting stands for how much volume of filament can be melted and extruded per second. Printing speed is limited by max volumetric speed, in case of too high and unreasonable speed setting. Can't be zero.",
      "wiki_page": "material_volumetric_speed_limitation#max-volumetric-speed"
    },
    "filament_minimal_purge_on_wipe_tower": {
      "type": "float",
      "label": "Minimal purge on wipe tower",
      "tooltip": "After a tool change, the exact position of the newly loaded filament inside the nozzle may not be known, and the filament pressure is likely not yet stable. Before purging the print head into an infill or a sacrificial object, Orca Slicer will always prime this amount of material into the wipe tower to produce successive infill or sacrificial object extrusions reliably.",
      "wiki_page": "material_multimaterial#multimaterial-wipe-tower-parameters"
    },
    "filament_multitool_ramming": {
      "type": "bool",
      "label": "Enable ramming for multi-tool setups",
      "tooltip": "Perform ramming when using multi-tool printer (i.e. when the 'Single Extruder Multimaterial' in Printer Settings is unchecked). When checked, a small amount of filament is rapidly extruded on the wipe tower just before the tool change. This option is only used when the wipe tower is enabled.",
      "wiki_page": "material_multimaterial#tool-change-parameters-with-multi-extruder"
    },
    "filament_multitool_ramming_flow": {
      "type": "float",
      "label": "Multi-tool ramming flow",
      "tooltip": "Flow used for ramming the filament before the tool change.",
      "wiki_page": "material_multimaterial#multi-tool-ramming-flow"
    },
    "filament_multitool_ramming_volume": {
      "type": "float",
      "label": "Multi-tool ramming volume",
      "tooltip": "The volume to be rammed before the tool change.",
      "wiki_page": "material_multimaterial#multi-tool-ramming-volume"
    },
    "filament_notes": {
      "type": "string",
      "label": "Filament notes",
      "tooltip": "You can put your notes regarding the filament here."
    },
    "filament_preset": {
      "type": "string",
      "label": "Filament preset name",
      "tooltip": "Names of the filament presets used for slicing. The variable is a vector containing one name for each extruder."
    },
    "filament_printable": {
      "type": "int",
      "label": "Filament printable",
      "tooltip": "The filament is printable in extruder."
    },
    "filament_ramming_parameters": {
      "type": "string",
      "label": "Ramming parameters",
      "tooltip": "This string is edited by RammingDialog and contains ramming specific parameters."
    },
    "filament_shrink": {
      "type": "percent",
      "label": "Shrinkage (XY)",
      "tooltip": "Enter the shrinkage percentage that the filament will get after cooling (94% if you measure 94mm instead of 100mm). The part will be scaled in XY to compensate. For multi-material prints, ensure filament shrinkage matches across all used filaments\nBe sure to allow enough space between objects, as this compensation is done after the checks.",
      "wiki_page": "material_basic_information#shrinkage-xy"
    },
    "filament_shrinkage_compensation_z": {
      "type": "percent",
      "label": "Shrinkage (Z)",
      "tooltip": "Enter the shrinkage percentage that the filament will get after cooling (94% if you measure 94mm instead of 100mm). The part will be scaled in Z to compensate.",
      "wiki_page": "material_basic_information#shrinkage-z"
    },
    "filament_soluble": {
      "type": "bool",
      "label": "Soluble material",
      "tooltip": "Soluble material is commonly used to print supports and support interfaces.",
      "wiki_page": "material_basic_information#soluble-material"
    },
    "filament_stamping_distance": {
      "type": "float",
      "label": "Stamping distance measured from the center of the cooling tube",
      "tooltip": "If set to non-zero value, filament is moved toward the nozzle between the individual cooling moves (\"stamping\"). This option configures how long this movement should be before the filament is retracted again.",
      "wiki_page": "material_multimaterial#stamping-distance"
    },
    "filament_stamping_loading_speed": {
      "type": "float",
      "label": "Stamping loading speed",
      "tooltip": "Speed used for stamping.",
      "wiki_page": "material_multimaterial#stamping-loading-speed"
    },
    "filament_start_gcode": {
      "type": "string",
      "label": "Start G-code",
      "tooltip": "Start G-code when starting the printing of this filament."
    },
    "filament_toolchange_delay": {
      "type": "float",
      "label": "Delay after unloading",
      "sidetext": "s",
      "tooltip": "Time to wait after the filament is unloaded. May help to get reliable tool changes with flexible materials that may need more time to shrink to original dimensions.",
      "wiki_page": "material_multimaterial#delay-after-unloading"
    },
    "filament_type": {
      "type": "string",
      "label": "Type",
      "tooltip": "The material type of filament.",
      "wiki_page": "material_basic_information#type"
    },
    "filament_unloading_speed": {
      "type": "float",
      "label": "Unloading speed",
      "sidetext": "mm/s",
      "tooltip": "Speed used for unloading the filament on the wipe tower (does not affect initial part of unloading just after ramming).",
      "wiki_page": "material_multimaterial#unloading-speed"
    },
    "filament_unloading_speed_start": {
      "type": "float",
      "label": "Unloading speed at the start",
      "sidetext": "mm/s",
      "tooltip": "Speed used for unloading the tip of the filament immediately after ramming.",
      "wiki_page": "material_multimaterial#unloading-speed-at-the-start"
    },
    "filament_vendor": {
      "type": "string",
      "label": "Vendor",
      "tooltip": "Vendor of filament. For show only.",
      "wiki_page": "material_basic_information#vendor"
    },
    "file_start_gcode": {
      "type": "string",
      "label": "File header G-code",
      "tooltip": "G-code written at the very top of the output file, before any other content. Useful for adding metadata that printer firmware reads from the first lines of the file (e.g. estimated print time, filament usage). Supports placeholders like {print_time_sec} and {used_filament_length}."
    },
    "filename_format": {
      "type": "string",
      "label": "Filename format",
      "tooltip": "Users can define the project file name when exporting."
    },
    "fill_multiline": {
      "type": "int",
      "label": "Fill Multiline",
      "category": "Strength",
      "tooltip": "Using multiple lines for the infill pattern, if supported by infill pattern.",
      "default": "1",
      "wiki_page": "strength_settings_infill#fill-multiline"
    },
    "filter_out_gap_fill": {
      "type": "float",
      "label": "Filter out tiny gaps",
      "category": "Layers and Perimeters",
      "sidetext": "mm",
      "tooltip": "Don't print gap fill with a length is smaller than the threshold specified (in mm). This setting applies to top, bottom and solid infill and, if using the classic perimeter generator, to wall gap fill.",
      "default": "0",
      "wiki_page": "strength_settings_infill#filter-out-tiny-gaps"
    },
    "first_layer_flow_ratio": {
      "type": "float",
      "label": "First layer flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material on the first layer for the extrusion path roles listed in this section.\n\nFor the first layer, the actual flow ratio for each path role (does not affect brims and skirts) will be multiplied by this value.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "first_layer_print_convex_hull": {
      "type": "points",
      "label": "First layer convex hull",
      "tooltip": "Vector of points of the first layer convex hull. Each element has the following format:'[x, y]' (x and y are floating-point numbers in mm)."
    },
    "first_layer_print_max": {
      "type": "float",
      "label": "Top-right corner of first layer bounding box"
    },
    "first_layer_print_min": {
      "type": "float",
      "label": "Bottom-left corner of first layer bounding box"
    },
    "first_layer_print_sequence": {
      "type": "int",
      "label": "First layer print sequence"
    },
    "first_layer_print_size": {
      "type": "float",
      "label": "Size of the first layer bounding box"
    },
    "first_layer_sequence_choice": {
      "type": "enum",
      "label": "First layer filament sequence",
      "category": "Quality"
    },
    "flush_into_infill": {
      "type": "bool",
      "label": "Flush into objects' infill",
      "category": "Flush options",
      "tooltip": "Purging after filament change will be done inside objects' infills. This may lower the amount of waste and decrease the print time. If the walls are printed with transparent filament, the mixed color infill will be seen outside. It will not take effect, unless the prime tower is enabled.",
      "default": "false",
      "wiki_page": "multimaterial_settings_flush_options#flush-into-objects-infill"
    },
    "flush_into_objects": {
      "type": "bool",
      "label": "Flush into this object",
      "category": "Flush options",
      "tooltip": "This object will be used to purge the nozzle after a filament change to save filament and decrease the print time. Colors of the objects will be mixed as a result. It will not take effect unless the prime tower is enabled.",
      "default": "false",
      "wiki_page": "multimaterial_settings_flush_options"
    },
    "flush_into_support": {
      "type": "bool",
      "label": "Flush into objects' support",
      "category": "Flush options",
      "tooltip": "Purging after filament change will be done inside objects' support. This may lower the amount of waste and decrease the print time. It will not take effect, unless the prime tower is enabled.",
      "default": "true",
      "wiki_page": "multimaterial_settings_flush_options#flush-into-objects-support"
    },
    "flush_multiplier": {
      "type": "float",
      "label": "Flush multiplier",
      "tooltip": "The actual flushing volumes is equal to the flush multiplier multiplied by the flushing volumes in the table."
    },
    "flush_volumes_matrix": {
      "type": "float",
      "label": "Purging volumes",
      "tooltip": "This matrix describes volumes (in cubic milimetres) required to purge the new filament on the wipe tower for any given pair of tools."
    },
    "full_fan_speed_layer": {
      "type": "int",
      "label": "Full fan speed at layer",
      "sidetext": "layer",
      "tooltip": "Fan speed will be ramped up linearly from zero at layer \"close_fan_the_first_x_layers\" to maximum at layer \"full_fan_speed_layer\". \"full_fan_speed_layer\" will be ignored if lower than \"close_fan_the_first_x_layers\", in which case the fan will be running at maximum allowed speed at layer \"close_fan_the_first_x_layers\" + 1.",
      "wiki_page": "material_cooling#full-fan-speed-at-layer"
    },
    "fuzzy_skin": {
      "type": "enum",
      "label": "Fuzzy Skin",
      "category": "Others",
      "tooltip": "Randomly jitter while printing the wall, so that the surface has a rough look. This setting controls the fuzzy position.",
      "wiki_page": "others_settings_fuzzy_skin"
    },
    "fuzzy_skin_first_layer": {
      "type": "bool",
      "label": "Apply fuzzy skin to first layer",
      "category": "Others",
      "tooltip": "Whether to apply fuzzy skin on the first layer.",
      "default": "0",
      "wiki_page": "others_settings_fuzzy_skin#apply-fuzzy-skin-to-first-layer"
    },
    "fuzzy_skin_mode": {
      "type": "enum",
      "label": "Fuzzy skin generator mode",
      "category": "Others",
      "tooltip": "Fuzzy skin generation mode. Works only with Arachne!\nDisplacement: Сlassic mode when the pattern is formed by shifting the nozzle sideways from the original path.\nExtrusion: The mode when the pattern formed by the amount of extruded plastic. This is the fast and straight algorithm without unnecessary nozzle shake that gives a smooth pattern. But it is more useful for forming loose walls in the entire they array.\nCombined: Joint mode [Displacement] + [Extrusion]. The appearance of the walls is similar to [Displacement] Mode, but it leaves no pores between the perimeters.\n\nAttention! The [Extrusion] and [Combined] modes works only the fuzzy_skin_thickness parameter not more than the thickness of printed loop. At the same time, the width of the extrusion for a particular layer should also not be below a certain level. It is usually equal 15-25%% of a layer height. Therefore, the maximum fuzzy skin thickness with a perimeter width of 0.4 mm and a layer height of 0.2 mm will be 0.4-(0.2*0.25)=±0.35mm! If you enter a higher parameter than this, the error Flow::spacing() will displayed, and the model will not be sliced. You can choose this number until this error is repeated.",
      "wiki_page": "others_settings_fuzzy_skin#fuzzy-skin-mode"
    },
    "fuzzy_skin_noise_type": {
      "type": "enum",
      "label": "Fuzzy skin noise type",
      "category": "Others",
      "tooltip": "Noise type to use for fuzzy skin generation:\nClassic: Classic uniform random noise.\nPerlin: Perlin noise, which gives a more consistent texture.\nBillow: Similar to perlin noise, but clumpier.\nRidged Multifractal: Ridged noise with sharp, jagged features. Creates marble-like textures.\nVoronoi: Divides the surface into voronoi cells, and displaces each one by a random amount. Creates a patchwork texture.",
      "wiki_page": "others_settings_fuzzy_skin#noise-type"
    },
    "fuzzy_skin_octaves": {
      "type": "int",
      "label": "Fuzzy Skin Noise Octaves",
      "category": "Others",
      "tooltip": "The number of octaves of coherent noise to use. Higher values increase the detail of the noise, but also increase computation time.",
      "default": "4",
      "wiki_page": "others_settings_fuzzy_skin#skin-noise-octaves"
    },
    "fuzzy_skin_persistence": {
      "type": "float",
      "label": "Fuzzy skin noise persistence",
      "category": "Others",
      "tooltip": "The decay rate for higher octaves of the coherent noise. Lower values will result in smoother noise.",
      "default": "0.5",
      "wiki_page": "others_settings_fuzzy_skin#skin-noise-persistence"
    },
    "fuzzy_skin_point_distance": {
      "type": "float",
      "label": "Fuzzy skin point distance",
      "category": "Others",
      "sidetext": "mm",
      "tooltip": "The average distance between the random points introduced on each line segment.",
      "default": "0.3",
      "wiki_page": "others_settings_fuzzy_skin#point-distance"
    },
    "fuzzy_skin_scale": {
      "type": "float",
      "label": "Fuzzy skin feature size",
      "category": "Others",
      "sidetext": "mm",
      "tooltip": "The base size of the coherent noise features, in mm. Higher values will result in larger features.",
      "default": "1.0",
      "wiki_page": "others_settings_fuzzy_skin#skin-feature-size"
    },
    "fuzzy_skin_thickness": {
      "type": "float",
      "label": "Fuzzy skin thickness",
      "category": "Others",
      "sidetext": "mm",
      "tooltip": "The width within which to jitter. It's advised to be below outer wall line width.",
      "default": "0.2",
      "wiki_page": "others_settings_fuzzy_skin#skin-thickness"
    },
    "gap_fill_flow_ratio": {
      "type": "float",
      "label": "Gap fill flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for filling the gaps.\n\nThe actual gap filling flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "gap_fill_target": {
      "type": "enum",
      "label": "Apply gap fill",
      "category": "Strength",
      "tooltip": "Enables gap fill for the selected solid surfaces. The minimum gap length that will be filled can be controlled from the filter out tiny gaps option below.\n\nOptions:\n1. Everywhere: Applies gap fill to top, bottom and internal solid surfaces for maximum strength\n2. Top and Bottom surfaces: Applies gap fill to top and bottom surfaces only, balancing print speed, reducing potential over extrusion in the solid infill and making sure the top and bottom surfaces have no pinhole gaps\n3. Nowhere: Disables gap fill for all solid infill areas\n\nNote that if using the classic perimeter generator, gap fill may also be generated between perimeters, if a full width line cannot fit between them. That perimeter gap fill is not controlled by this setting.\n\nIf you would like all gap fill, including the classic perimeter generated one, removed, set the filter out tiny gaps value to a large number, like 999999.\n\nHowever this is not advised, as gap fill between perimeters is contributing to the model's strength. For models where excessive gap fill is generated between perimeters, a better option would be to switch to the arachne wall generator and use this option to control whether the cosmetic top and bottom surface gap fill is generated.",
      "wiki_page": "strength_settings_infill#apply-gap-fill"
    },
    "gap_infill_speed": {
      "type": "float",
      "label": "Gap infill",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of gap infill. Gap usually has irregular line width and should be printed more slowly.",
      "default": "30",
      "wiki_page": "speed_settings_other_layers_speed#gap-infill"
    },
    "gcode_add_line_number": {
      "type": "bool",
      "label": "Add line number",
      "tooltip": "Enable this to add line number(Nx) at the beginning of each G-code line.",
      "default": "0",
      "wiki_page": "others_settings_g_code_output#add-line-number"
    },
    "gcode_comments": {
      "type": "bool",
      "label": "Verbose G-code",
      "tooltip": "Enable this to get a commented G-code file, with each line explained by a descriptive text. If you print from SD card, the additional weight of the file could make your firmware slow down.",
      "default": "0",
      "wiki_page": "others_settings_g_code_output#verbose-g-code"
    },
    "gcode_flavor": {
      "type": "enum",
      "label": "G-code flavor",
      "tooltip": "What kind of G-code the printer is compatible with.",
      "wiki_page": "printer_basic_information_advanced#g-code-flavor"
    },
    "gcode_label_objects": {
      "type": "bool",
      "label": "Label objects",
      "tooltip": "Enable this to add comments into the G-code labeling print moves with what object they belong to, which is useful for the Octoprint CancelObject plugin. This settings is NOT compatible with Single Extruder Multi Material setup and Wipe into Object / Wipe into Infill.",
      "default": "1",
      "wiki_page": "others_settings_g_code_output#label-objects"
    },
    "gcodeviewer": {
      "type": "bool",
      "label": "G-code viewer",
      "tooltip": "Visualize an already sliced and saved G-code.",
      "default": "false"
    },
    "grab_length": {
      "type": "float",
      "label": "Grab length",
      "sidetext": "mm"
    },
    "has_single_extruder_multi_material_priming": {
      "type": "bool",
      "label": "Has single extruder MM priming",
      "tooltip": "Are the extra multi-material priming regions used in this print?"
    },
    "has_wipe_tower": {
      "type": "bool",
      "label": "Has wipe tower",
      "tooltip": "Whether or not wipe tower is being generated in the print."
    },
    "help": {
      "type": "bool",
      "label": "Help",
      "tooltip": "Show command help.",
      "default": "false"
    },
    "help_fff": {
      "type": "bool",
      "label": "Help (FFF options)",
      "tooltip": "Show the full list of print/G-code configuration options.",
      "default": "false"
    },
    "help_sla": {
      "type": "bool",
      "label": "Help (SLA options)",
      "tooltip": "Show the full list of SLA print configuration options.",
      "default": "false"
    },
    "high_current_on_filament_swap": {
      "type": "bool",
      "label": "High extruder current on filament swap",
      "tooltip": "It may be beneficial to increase the extruder motor current during the filament exchange sequence to allow for rapid ramming feed rates and to overcome resistance when loading a filament with an ugly shaped tip.",
      "default": "0",
      "wiki_page": "printer_multimaterial_semm_parameters#high-extruder-current-on-filament-swap"
    },
    "hole_to_polyhole": {
      "type": "bool",
      "label": "Convert holes to polyholes",
      "category": "Quality",
      "tooltip": "Search for almost-circular holes that span more than one layer and convert the geometry to polyholes. Use the nozzle size and the (biggest) diameter to compute the polyhole.\nSee http://hydraraptor.blogspot.com/2011/02/polyholes.html",
      "default": "false",
      "wiki_page": "quality_settings_precision#polyholes"
    },
    "hole_to_polyhole_threshold": {
      "type": "coFloatOrPercent",
      "label": "Polyhole detection margin",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Maximum defection of a point to the estimated radius of the circle.\nAs cylinders are often exported as triangles of varying size, points may not be on the circle circumference. This setting allows you some leeway to broaden the detection.\nIn mm or in % of the radius.",
      "wiki_page": "quality_settings_precision#polyholes"
    },
    "hole_to_polyhole_twisted": {
      "type": "bool",
      "label": "Polyhole twist",
      "category": "Quality",
      "tooltip": "Rotate the polyhole every layer.",
      "default": "true",
      "wiki_page": "quality_settings_precision#polyholes"
    },
    "host_type": {
      "type": "enum",
      "label": "Host Type",
      "tooltip": "Orca Slicer can upload G-code files to a printer host. This field must contain the kind of the host."
    },
    "hot_plate_temp": {
      "type": "int",
      "label": "Other layers",
      "full_label": "Bed temperature",
      "tooltip": "Bed temperature for layers except the initial one. A value of 0 means the filament does not support printing on the High Temp Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "hot_plate_temp_initial_layer": {
      "type": "int",
      "label": "Initial layer",
      "full_label": "Initial layer bed temperature",
      "tooltip": "Bed temperature of the initial layer. A value of 0 means the filament does not support printing on the High Temp Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "hour": {
      "type": "int",
      "label": "Hour"
    },
    "idle_temperature": {
      "type": "int",
      "label": "Idle temperature",
      "tooltip": "Nozzle temperature when the tool is currently not used in multi-tool setups. This is only used when 'Ooze prevention' is active in Print Settings. Set to 0 to disable.",
      "wiki_page": "material_basic_information#idle-temperature"
    },
    "ignore_nonexistent_config": {
      "type": "bool",
      "label": "Ignore non-existent config files",
      "tooltip": "Do not fail if a file supplied to --load does not exist."
    },
    "independent_support_layer_height": {
      "type": "bool",
      "label": "Independent support layer height",
      "category": "Support",
      "tooltip": "Support layer uses layer height independent with object layer. This is to support customizing Z-gap and save print time. This option will be invalid when the prime tower is enabled.",
      "default": "true",
      "wiki_page": "support_settings_advanced#independent-support-layer-height"
    },
    "infill_anchor": {
      "type": "coFloatOrPercent",
      "label": "Sparse infill anchor length",
      "category": "Strength",
      "sidetext": "mm or %",
      "tooltip": "Connect an infill line to an internal perimeter with a short segment of an additional perimeter. If expressed as percentage (example: 15%) it is calculated over infill extrusion width. Orca Slicer tries to connect two close infill lines to a short perimeter segment. If no such perimeter segment shorter than infill_anchor_max is found, the infill line is connected to a perimeter segment at just one side and the length of the perimeter segment taken is limited to this parameter, but no longer than anchor_length_max.\nSet this parameter to zero to disable anchoring perimeters connected to a single infill line.",
      "wiki_page": "strength_settings_infill#anchor"
    },
    "infill_anchor_max": {
      "type": "coFloatOrPercent",
      "label": "Maximum length of the infill anchor",
      "category": "Strength",
      "tooltip": "Connect an infill line to an internal perimeter with a short segment of an additional perimeter. If expressed as percentage (example: 15%) it is calculated over infill extrusion width. Orca Slicer tries to connect two close infill lines to a short perimeter segment. If no such perimeter segment shorter than this parameter is found, the infill line is connected to a perimeter segment at just one side and the length of the perimeter segment taken is limited to infill_anchor, but no longer than this parameter.\nIf set to 0, the old algorithm for infill connection will be used, it should create the same result as with 1000 & 0.",
      "wiki_page": "strength_settings_infill#anchor"
    },
    "infill_combination": {
      "type": "bool",
      "label": "Infill combination",
      "category": "Strength",
      "tooltip": "Automatically Combine sparse infill of several layers to print together to reduce time. Wall is still printed with original layer height.",
      "default": "false",
      "wiki_page": "strength_settings_advanced#infill-combination"
    },
    "infill_combination_max_layer_height": {
      "type": "coFloatOrPercent",
      "label": "Infill combination - Max layer height",
      "category": "Strength",
      "sidetext": "mm or %",
      "tooltip": "Maximum layer height for the combined sparse infill.\n\nSet it to 0 or 100% to use the nozzle diameter (for maximum reduction in print time) or a value of ~80% to maximize sparse infill strength.\n\nThe number of layers over which infill is combined is derived by dividing this value with the layer height and rounded down to the nearest decimal.\n\nUse either absolute mm values (eg. 0.32mm for a 0.4mm nozzle) or % values (eg 80%). This value must not be larger than the nozzle diameter.",
      "wiki_page": "strength_settings_advanced#max-layer-height"
    },
    "infill_direction": {
      "type": "float",
      "label": "Sparse infill direction",
      "category": "Strength",
      "tooltip": "Angle for sparse infill pattern, which controls the start or main direction of line.",
      "default": "45",
      "wiki_page": "strength_settings_infill#direction"
    },
    "infill_jerk": {
      "type": "float",
      "label": "Infill",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Jerk for infill.",
      "default": "9",
      "wiki_page": "speed_settings_jerk_xy#infill"
    },
    "infill_lock_depth": {
      "type": "float",
      "label": "Infill lock depth",
      "category": "Strength",
      "sidetext": "mm",
      "tooltip": "The parameter sets the overlapping depth between the interior and skin.",
      "default": "1.0",
      "wiki_page": "strength_settings_patterns#locked-zag"
    },
    "infill_overhang_angle": {
      "type": "float",
      "label": "Infill overhang angle",
      "category": "Strength",
      "tooltip": "The angle of the infill angled lines. 60° will result in a pure honeycomb.",
      "default": "60",
      "wiki_page": "strength_settings_patterns#lateral-honeycomb"
    },
    "infill_shift_step": {
      "type": "float",
      "label": "Infill shift step",
      "category": "Strength",
      "sidetext": "mm",
      "tooltip": "This parameter adds a slight displacement to each layer of infill to create a cross texture.",
      "default": "0.4",
      "wiki_page": "strength_settings_patterns#cross-hatch"
    },
    "infill_wall_overlap": {
      "type": "percent",
      "label": "Infill/Wall overlap",
      "category": "Strength",
      "tooltip": "Infill area is enlarged slightly to overlap with wall for better bonding. The percentage value is relative to line width of sparse infill. Set this value to ~10-15% to minimize potential over extrusion and accumulation of material resulting in rough top surfaces.",
      "default": "15",
      "wiki_page": "strength_settings_infill#infill-wall-overlap"
    },
    "info": {
      "type": "bool",
      "label": "Output Model Info",
      "tooltip": "Output the model's information.",
      "default": "false"
    },
    "inherits": {
      "type": "string",
      "label": "Inherits profile",
      "tooltip": "Name of parent profile."
    },
    "initial_extruder": {
      "type": "int",
      "label": "Initial extruder",
      "tooltip": "Zero-based index of the first extruder used in the print. Same as initial_tool."
    },
    "initial_filament_type": {
      "type": "string",
      "label": "Initial filament type",
      "tooltip": "String containing filament type of the first used extruder."
    },
    "initial_layer_acceleration": {
      "type": "float",
      "label": "Initial layer",
      "category": "Speed",
      "tooltip": "Acceleration of initial layer. Using a lower value can improve build plate adhesion.",
      "default": "300",
      "wiki_page": "speed_settings_acceleration#initial-layer"
    },
    "initial_layer_infill_speed": {
      "type": "float",
      "label": "Initial layer infill",
      "sidetext": "mm/s",
      "tooltip": "Speed of solid infill part of initial layer.",
      "default": "60.0",
      "wiki_page": "speed_settings_initial_layer_speed#initial-layer-infill"
    },
    "initial_layer_jerk": {
      "type": "float",
      "label": "Initial layer",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Jerk for initial layer.",
      "default": "9",
      "wiki_page": "speed_settings_jerk_xy#initial-layer"
    },
    "initial_layer_line_width": {
      "type": "coFloatOrPercent",
      "label": "Initial layer",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Line width of initial layer. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "initial_layer_min_bead_width": {
      "type": "percent",
      "label": "First layer minimum wall width",
      "category": "Quality",
      "tooltip": "The minimum wall width that should be used for the first layer is recommended to be set to the same size as the nozzle. This adjustment is expected to enhance adhesion.",
      "default": "85",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "initial_layer_print_height": {
      "type": "float",
      "label": "Initial layer height",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Height of initial layer. Making initial layer height to be thick slightly can improve build plate adhesion.",
      "default": "0.2",
      "wiki_page": "quality_settings_layer_height"
    },
    "initial_layer_speed": {
      "type": "float",
      "label": "Initial layer",
      "sidetext": "mm/s",
      "tooltip": "Speed of initial layer except the solid infill part.",
      "default": "30",
      "wiki_page": "speed_settings_initial_layer_speed#initial-layer"
    },
    "initial_layer_travel_speed": {
      "type": "coFloatOrPercent",
      "label": "Initial layer travel speed",
      "category": "Speed",
      "sidetext": "mm/s or %",
      "tooltip": "Travel speed of initial layer.",
      "wiki_page": "speed_settings_initial_layer_speed#initial-layer-travel-speed"
    },
    "initial_tool": {
      "type": "int",
      "label": "Initial tool",
      "tooltip": "Zero-based index of the first extruder used in the print. Same as initial_extruder."
    },
    "inner_wall_acceleration": {
      "type": "float",
      "label": "Inner wall",
      "category": "Speed",
      "tooltip": "Acceleration of inner walls.",
      "default": "10000",
      "wiki_page": "speed_settings_acceleration#inner-wall"
    },
    "inner_wall_flow_ratio": {
      "type": "float",
      "label": "Inner wall flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for inner walls.\n\nThe actual inner wall flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "inner_wall_jerk": {
      "type": "float",
      "label": "Inner wall",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Jerk of inner walls.",
      "default": "9",
      "wiki_page": "speed_settings_jerk_xy#inner-wall"
    },
    "inner_wall_line_width": {
      "type": "coFloatOrPercent",
      "label": "Inner wall",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Line width of inner wall. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "inner_wall_speed": {
      "type": "float",
      "label": "Inner wall",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of inner wall.",
      "default": "60",
      "wiki_page": "speed_settings_other_layers_speed#inner-wall"
    },
    "input_filename_base": {
      "type": "string",
      "label": "Input filename without extension",
      "tooltip": "Source filename of the first object, without extension."
    },
    "interface_shells": {
      "type": "bool",
      "label": "Interface shells",
      "category": "Quality",
      "tooltip": "Force the generation of solid shells between adjacent materials/volumes. Useful for multi-extruder prints with translucent materials or manual soluble support material.",
      "default": "false",
      "wiki_page": "multimaterial_settings_advanced#interface-shells"
    },
    "interlocking_beam": {
      "type": "bool",
      "label": "Use beam interlocking",
      "category": "Advanced",
      "tooltip": "Generate interlocking beam structure at the locations where different filaments touch. This improves the adhesion between filaments, especially models printed in different materials.",
      "default": "false",
      "wiki_page": "multimaterial_settings_advanced#interlocking-beam"
    },
    "interlocking_beam_layer_count": {
      "type": "int",
      "label": "Interlocking beam layers",
      "category": "Advanced",
      "tooltip": "The height of the beams of the interlocking structure, measured in number of layers. Less layers is stronger, but more prone to defects.",
      "default": "2",
      "wiki_page": "multimaterial_settings_advanced#interlocking-beam-layers"
    },
    "interlocking_beam_width": {
      "type": "float",
      "label": "Interlocking beam width",
      "category": "Advanced",
      "sidetext": "mm",
      "tooltip": "The width of the interlocking structure beams.",
      "default": "0.8",
      "wiki_page": "multimaterial_settings_advanced#interlocking-beam-width"
    },
    "interlocking_boundary_avoidance": {
      "type": "int",
      "label": "Interlocking boundary avoidance",
      "category": "Advanced",
      "tooltip": "The distance from the outside of a model where interlocking structures will not be generated, measured in cells.",
      "default": "2",
      "wiki_page": "multimaterial_settings_advanced#interlocking-boundary-avoidance"
    },
    "interlocking_depth": {
      "type": "int",
      "label": "Interlocking depth",
      "category": "Advanced",
      "tooltip": "The distance from the boundary between filaments to generate interlocking structure, measured in cells. Too few cells will result in poor adhesion.",
      "default": "2",
      "wiki_page": "multimaterial_settings_advanced#interlocking-depth"
    },
    "interlocking_orientation": {
      "type": "float",
      "label": "Interlocking direction",
      "category": "Advanced",
      "tooltip": "Orientation of interlock beams.",
      "default": "22.5",
      "wiki_page": "multimaterial_settings_advanced#interlocking-direction"
    },
    "internal_bridge_angle": {
      "type": "float",
      "label": "Internal bridge infill direction",
      "category": "Strength",
      "tooltip": "Internal bridging angle override. If left to zero, the bridging angle will be calculated automatically. Otherwise the provided angle will be used for internal bridges. Use 180° for zero angle.\n\nIt is recommended to leave it at 0 unless there is a specific model need not to.",
      "default": "0.0",
      "wiki_page": "strength_settings_advanced#bridge-infill-direction"
    },
    "internal_bridge_density": {
      "type": "percent",
      "label": "Internal bridge density",
      "category": "Strength",
      "tooltip": "Controls the density (spacing) of internal bridge lines. 100% means solid bridge. Default is 100%.\n\nLower density internal bridges can help reduce top surface pillowing and improve internal bridge reliability as there is more space for air to circulate around the extruded bridge, improving its cooling speed.\n\nThis option works particularly well when combined with the second internal bridge over infill option, further improving internal bridging structure before solid infill is extruded.",
      "default": "100",
      "wiki_page": "quality_settings_bridging#bridge-density"
    },
    "internal_bridge_fan_speed": {
      "type": "int",
      "label": "Internal bridges fan speed",
      "tooltip": "The part cooling fan speed used for all internal bridges. Set to -1 to use the overhang fan speed settings instead.\n\nReducing the internal bridges fan speed, compared to your regular fan speed, can help reduce part warping due to excessive cooling applied over a large surface for a prolonged period of time.",
      "wiki_page": "material_cooling#internal-bridges-fan-speed"
    },
    "internal_bridge_flow": {
      "type": "float",
      "label": "Internal bridge flow ratio",
      "category": "Quality",
      "tooltip": "This value governs the thickness of the internal bridge layer. This is the first layer over sparse infill. Decrease this value slightly (for example 0.9) to improve surface quality over sparse infill.\n\nThe actual internal bridge flow used is calculated by multiplying this value with the bridge flow ratio, the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_bridging#flow-ratio"
    },
    "internal_bridge_speed": {
      "type": "coFloatOrPercent",
      "label": "Internal",
      "category": "Speed",
      "sidetext": "mm/s or %",
      "tooltip": "Speed of internal bridges. If the value is expressed as a percentage, it will be calculated based on the bridge_speed. Default value is 150%.",
      "wiki_page": "speed_settings_other_layers_speed#bridge"
    },
    "internal_solid_infill_acceleration": {
      "type": "coFloatOrPercent",
      "label": "Internal solid infill",
      "category": "Speed",
      "sidetext": "mm/s² or %",
      "tooltip": "Acceleration of internal solid infill. If the value is expressed as a percentage (e.g. 100%), it will be calculated based on the default acceleration.",
      "wiki_page": "speed_settings_acceleration#internal-solid-infill"
    },
    "internal_solid_infill_flow_ratio": {
      "type": "float",
      "label": "Internal solid infill flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for internal solid infill.\n\nThe actual internal solid infill flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "internal_solid_infill_line_width": {
      "type": "coFloatOrPercent",
      "label": "Internal solid infill",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Line width of internal solid infill. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "internal_solid_infill_pattern": {
      "type": "enum",
      "label": "Internal solid infill pattern",
      "category": "Strength",
      "tooltip": "Line pattern of internal solid infill. if the detect narrow internal solid infill be enabled, the concentric pattern will be used for the small area.",
      "wiki_page": "strength_settings_infill#internal-solid-infill"
    },
    "internal_solid_infill_speed": {
      "type": "float",
      "label": "Internal solid infill",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of internal solid infill, not the top and bottom surface.",
      "default": "100",
      "wiki_page": "speed_settings_other_layers_speed#internal-solid-infill"
    },
    "ironing_angle": {
      "type": "float",
      "label": "Ironing angle offset",
      "category": "Quality",
      "tooltip": "The angle of ironing lines offset from the top surface.",
      "default": "0",
      "wiki_page": "quality_settings_ironing#angle-offset"
    },
    "ironing_angle_fixed": {
      "type": "bool",
      "label": "Fixed ironing angle",
      "category": "Quality",
      "tooltip": "Use a fixed absolute angle for ironing.",
      "default": "false",
      "wiki_page": "quality_settings_ironing#fixed-angle"
    },
    "ironing_fan_speed": {
      "type": "int",
      "label": "Ironing fan speed",
      "tooltip": "This part cooling fan speed is applied when ironing. Setting this parameter to a lower than regular speed reduces possible nozzle clogging due to the low volumetric flow rate, making the interface smoother.\nSet to -1 to disable it.",
      "wiki_page": "material_cooling#ironing-fan-speed"
    },
    "ironing_flow": {
      "type": "percent",
      "label": "Ironing flow",
      "category": "Quality",
      "tooltip": "The amount of material to extrude during ironing. Relative to flow of normal layer height. Too high value results in overextrusion on the surface.",
      "default": "10",
      "wiki_page": "quality_settings_ironing#flow"
    },
    "ironing_inset": {
      "type": "float",
      "label": "Ironing inset",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "The distance to keep from the edges. A value of 0 sets this to half of the nozzle diameter.",
      "default": "0",
      "wiki_page": "quality_settings_ironing#inset"
    },
    "ironing_pattern": {
      "type": "enum",
      "label": "Ironing Pattern",
      "category": "Quality",
      "tooltip": "The pattern that will be used when ironing.",
      "wiki_page": "quality_settings_ironing#pattern"
    },
    "ironing_spacing": {
      "type": "float",
      "label": "Ironing line spacing",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "The distance between the lines of ironing.",
      "default": "0.1",
      "wiki_page": "quality_settings_ironing#line-spacing"
    },
    "ironing_speed": {
      "type": "float",
      "label": "Ironing speed",
      "category": "Quality",
      "sidetext": "mm/s",
      "tooltip": "Print speed of ironing lines.",
      "default": "20",
      "wiki_page": "speed_settings_other_layers_speed#ironing-speed"
    },
    "ironing_type": {
      "type": "enum",
      "label": "Ironing Type",
      "category": "Quality",
      "tooltip": "Ironing is using small flow to print on same height of surface again to make flat surface more smooth. This setting controls which layer being ironed",
      "wiki_page": "quality_settings_ironing#type"
    },
    "is_extruder_used": {
      "type": "bool",
      "label": "Is extruder used?",
      "tooltip": "Vector of booleans stating whether a given extruder is used in the print."
    },
    "is_infill_first": {
      "type": "bool",
      "label": "Print infill first",
      "category": "Quality",
      "tooltip": "Order of wall/infill. When the tickbox is unchecked the walls are printed first, which works best in most cases.\n\nPrinting infill first may help with extreme overhangs as the walls have the neighbouring infill to adhere to. However, the infill will slightly push out the printed walls where it is attached to them, resulting in a worse external surface finish. It can also cause the infill to shine through the external surfaces of the part.",
      "wiki_page": "quality_settings_wall_and_surfaces#print-infill-first"
    },
    "lateral_lattice_angle_1": {
      "type": "float",
      "label": "Lateral lattice angle 1",
      "category": "Strength",
      "tooltip": "The angle of the first set of Lateral lattice elements in the Z direction. Zero is vertical.",
      "default": "-45",
      "wiki_page": "strength_settings_patterns#lateral-lattice"
    },
    "lateral_lattice_angle_2": {
      "type": "float",
      "label": "Lateral lattice angle 2",
      "category": "Strength",
      "tooltip": "The angle of the second set of Lateral lattice elements in the Z direction. Zero is vertical.",
      "default": "45",
      "wiki_page": "strength_settings_patterns#lateral-lattice"
    },
    "layer_change_gcode": {
      "type": "string",
      "label": "Layer change G-code",
      "tooltip": "This G-code is inserted at every layer change after the Z lift."
    },
    "layer_height": {
      "type": "float",
      "label": "Layer height",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Slicing height for each layer. Smaller layer height means more accurate and more printing time.",
      "default": "INITIAL_LAYER_HEIGHT",
      "wiki_page": "quality_settings_layer_height"
    },
    "layer_num": {
      "type": "int",
      "label": "Layer number",
      "tooltip": "Index of the current layer. One-based (i.e. first layer is number 1)."
    },
    "layer_z": {
      "type": "float",
      "label": "Layer Z",
      "tooltip": "Height of the current layer above the print bed, measured to the top of the layer."
    },
    "line_width": {
      "type": "coFloatOrPercent",
      "label": "Default",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Default line width if other line widths are set to 0. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "load": {
      "type": "string",
      "label": "Load config file",
      "tooltip": "Load configuration from the specified file. It can be used more than once to load options from multiple files."
    },
    "load_assemble_list": {
      "type": "string",
      "label": "Load assemble list",
      "tooltip": "Load assemble object list from config file."
    },
    "load_custom_gcodes": {
      "type": "string",
      "label": "Load custom G-code",
      "tooltip": "Load custom G-code from json."
    },
    "load_defaultfila": {
      "type": "bool",
      "label": "Load default filaments",
      "tooltip": "Load first filament as default for those not loaded.",
      "default": "false"
    },
    "load_filament_ids": {
      "type": "int",
      "label": "Load filament IDs",
      "tooltip": "Load filament IDs for each object."
    },
    "load_filaments": {
      "type": "string",
      "label": "Load Filament Settings",
      "tooltip": "Load filament settings from the specified file list."
    },
    "load_settings": {
      "type": "string",
      "label": "Load General Settings",
      "tooltip": "Load process/machine settings from the specified file."
    },
    "load_slicedata": {
      "type": "string",
      "label": "Load slicing data",
      "tooltip": "Load cached slicing data from directory."
    },
    "long_retractions_when_cut": {
      "type": "bool",
      "label": "Long retraction when cut (beta)",
      "tooltip": "Experimental feature: Retracting and cutting off the filament at a longer distance during changes to minimize purge. While this reduces flush significantly, it may also raise the risk of nozzle clogs or other printing problems.",
      "wiki_page": "printer_extruder_retraction#long-retraction-when-cut-beta"
    },
    "long_retractions_when_ec": {
      "type": "bool",
      "label": "Long retraction when extruder change",
      "wiki_page": "material_multimaterial#multi-filament"
    },
    "machine_end_gcode": {
      "type": "string",
      "label": "End G-code",
      "tooltip": "End G-code when finishing the entire print."
    },
    "machine_load_filament_time": {
      "type": "float",
      "label": "Filament load time",
      "sidetext": "s",
      "tooltip": "Time to load new filament when switch filament. It's usually applicable for single-extruder multi-material machines. For tool changers or multi-tool machines, it's typically 0. For statistics only.",
      "default": "0.0",
      "wiki_page": "printer_multimaterial_advanced#filament-load-time"
    },
    "machine_pause_gcode": {
      "type": "string",
      "label": "Pause G-code",
      "tooltip": "This G-code will be used as a code for the pause print. Users can insert pause G-code in the G-code viewer."
    },
    "machine_start_gcode": {
      "type": "string",
      "label": "Start G-code",
      "tooltip": "Start G-code when starting the entire print."
    },
    "machine_tool_change_time": {
      "type": "float",
      "label": "Tool change time",
      "sidetext": "s",
      "tooltip": "Time taken to switch tools. It's usually applicable for tool changers or multi-tool machines. For single-extruder multi-material machines, it's typically 0. For statistics only.",
      "wiki_page": "printer_multimaterial_advanced#tool-change-time"
    },
    "machine_unload_filament_time": {
      "type": "float",
      "label": "Filament unload time",
      "sidetext": "s",
      "tooltip": "Time to unload old filament when switch filament. It's usually applicable for single-extruder multi-material machines. For tool changers or multi-tool machines, it's typically 0. For statistics only.",
      "default": "0.0",
      "wiki_page": "printer_multimaterial_advanced#filament-unload-time"
    },
    "make_overhang_printable": {
      "type": "bool",
      "label": "Make overhangs printable",
      "category": "Quality",
      "tooltip": "Modify the geometry to print overhangs without support material.",
      "default": "false",
      "wiki_page": "quality_settings_overhangs#make-overhang-printable"
    },
    "make_overhang_printable_angle": {
      "type": "float",
      "label": "Make overhangs printable - Maximum angle",
      "category": "Quality",
      "tooltip": "Maximum angle of overhangs to allow after making more steep overhangs printable.90° will not change the model at all and allow any overhang, while 0 will replace all overhangs with conical material.",
      "default": "55.0",
      "wiki_page": "quality_settings_overhangs#maximum-angle"
    },
    "make_overhang_printable_hole_size": {
      "type": "float",
      "label": "Make overhangs printable - Hole area",
      "category": "Quality",
      "tooltip": "Maximum area of a hole in the base of the model before it's filled by conical material. A value of 0 will fill all the holes in the model base.",
      "default": "0.0",
      "wiki_page": "quality_settings_overhangs#hole-area"
    },
    "makerlab_name": {
      "type": "string",
      "label": "MakerLab name",
      "tooltip": "MakerLab name to generate this 3MF."
    },
    "makerlab_version": {
      "type": "string",
      "label": "MakerLab version",
      "tooltip": "MakerLab version to generate this 3MF."
    },
    "manual_filament_change": {
      "type": "bool",
      "label": "Manual Filament Change",
      "tooltip": "Enable this option to omit the custom Change filament G-code only at the beginning of the print. The tool change command (e.g., T0) will be skipped throughout the entire print. This is useful for manual multi-material printing, where we use M600/PAUSE to trigger the manual filament change action.",
      "default": "false",
      "wiki_page": "printer_multimaterial_setup#manual-filament-change"
    },
    "max_bridge_length": {
      "type": "float",
      "label": "Max bridge length",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Max length of bridges that don't need support. Set it to 0 if you want all bridges to be supported, and set it to a very large value if you don't want any bridges to be supported.",
      "default": "10",
      "wiki_page": "support_settings_advanced"
    },
    "max_layer_height": {
      "type": "float",
      "label": "Max",
      "sidetext": "mm",
      "tooltip": "The highest printable layer height for the extruder. Used to limit the maximum layer height when enable adaptive layer height.",
      "wiki_page": "printer_extruder_basic_information#extruder-layer-height-limits"
    },
    "max_layer_z": {
      "type": "float",
      "label": "Maximal layer Z",
      "tooltip": "Height of the last layer above the print bed."
    },
    "max_resonance_avoidance_speed": {
      "type": "float",
      "label": "Max",
      "sidetext": "mm/s",
      "tooltip": "Maximum speed of resonance avoidance.",
      "default": "120",
      "wiki_page": "printer_motion_ability#resonance-avoidance-speed"
    },
    "max_travel_detour_distance": {
      "type": "coFloatOrPercent",
      "label": "Avoid crossing walls - Max detour length",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Maximum detour distance for avoiding crossing wall. Don't detour if the detour distance is larger than this value. Detour length could be specified either as an absolute value or as percentage (for example 50%) of a direct travel path. Zero to disable.",
      "wiki_page": "quality_settings_wall_and_surfaces#max-detour-length"
    },
    "max_volumetric_extrusion_rate_slope": {
      "type": "float",
      "label": "Extrusion rate smoothing",
      "tooltip": "This parameter smooths out sudden extrusion rate changes that happen when the printer transitions from printing a high flow (high speed/larger width) extrusion to a lower flow (lower speed/smaller width) extrusion and vice versa.\n\nIt defines the maximum rate by which the extruded volumetric flow in mm³/s can change over time. Higher values mean higher extrusion rate changes are allowed, resulting in faster speed transitions.\n\nA value of 0 disables the feature.\n\nFor a high speed, high flow direct drive printer (like the Bambu lab or Voron) this value is usually not needed. However it can provide some marginal benefit in certain cases where feature speeds vary greatly. For example, when there are aggressive slowdowns due to overhangs. In these cases a high value of around 300-350 mm³/s² is recommended as this allows for just enough smoothing to assist pressure advance achieve a smoother flow transition.\n\nFor slower printers without pressure advance, the value should be set much lower. A value of 10-15 mm³/s² is a good starting point for direct drive extruders and 5-10 mm³/s² for Bowden style.\n\nThis feature is known as Pressure Equalizer in Prusa slicer.\n\nNote: this parameter disables arc fitting.",
      "default": "0",
      "wiki_page": "speed_settings_advanced"
    },
    "max_volumetric_extrusion_rate_slope_segment_length": {
      "type": "float",
      "label": "Smoothing segment length",
      "sidetext": "mm",
      "tooltip": "A lower value results in smoother extrusion rate transitions. However, this results in a significantly larger G-code file and more instructions for the printer to process.\n\nDefault value of 3 works well for most cases. If your printer is stuttering, increase this value to reduce the number of adjustments made.\n\nAllowed values: 0.5-5",
      "default": "3.0",
      "wiki_page": "speed_settings_advanced"
    },
    "metadata_name": {
      "type": "string",
      "label": "Metadata name list",
      "tooltip": "Metadata name list added into 3MF."
    },
    "metadata_value": {
      "type": "string",
      "label": "Metadata value list",
      "tooltip": "Metadata value list added into 3MF."
    },
    "min_bead_width": {
      "type": "percent",
      "label": "Minimum wall width",
      "category": "Quality",
      "tooltip": "Width of the wall that will replace thin features (according to the Minimum feature size) of the model. If the Minimum wall width is thinner than the thickness of the feature, the wall will become as thick as the feature itself. It's expressed as a percentage over nozzle diameter.",
      "default": "85",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "min_feature_size": {
      "type": "percent",
      "label": "Minimum feature size",
      "category": "Quality",
      "tooltip": "Minimum thickness of thin features. Model features that are thinner than this value will not be printed, while features thicker than than this value will be widened to the minimum wall width. It's expressed as a percentage over nozzle diameter.",
      "default": "25",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "min_layer_height": {
      "type": "float",
      "label": "Min",
      "sidetext": "mm",
      "tooltip": "The lowest printable layer height for the extruder. Used to limit the minimum layer height when enable adaptive layer height.",
      "wiki_page": "printer_extruder_basic_information#extruder-layer-height-limits"
    },
    "min_length_factor": {
      "type": "float",
      "label": "Minimum wall length",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Adjust this value to prevent short, unclosed walls from being printed, which could increase print time. Higher values remove more and longer walls.\n\nNOTE: Bottom and top surfaces will not be affected by this value to prevent visual gaps on the outside of the model. Adjust 'One wall threshold' in the Advanced settings below to adjust the sensitivity of what is considered a top-surface. 'One wall threshold' is only visible if this setting is set above the default value of 0.5, or if single-wall top surfaces is enabled.",
      "default": "0.5",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "min_resonance_avoidance_speed": {
      "type": "float",
      "label": "Min",
      "sidetext": "mm/s",
      "tooltip": "Minimum speed of resonance avoidance.",
      "default": "70",
      "wiki_page": "printer_motion_ability#resonance-avoidance-speed"
    },
    "min_save": {
      "type": "bool",
      "label": "Minimum save",
      "tooltip": "Export 3MF with minimum size.",
      "default": "false"
    },
    "min_skirt_length": {
      "type": "float",
      "label": "Skirt minimum extrusion length",
      "full_label": "Skirt minimum extrusion length",
      "sidetext": "mm",
      "tooltip": "Minimum filament extrusion length in mm when printing the skirt. Zero means this feature is disabled.\n\nUsing a non-zero value is useful if the printer is set up to print without a prime line.\nFinal number of loops is not taking into account while arranging or validating objects distance. Increase loop number in such case.",
      "default": "0.0",
      "wiki_page": "others_settings_skirt#minimum-extrusion-length"
    },
    "min_width_top_surface": {
      "type": "coFloatOrPercent",
      "label": "One wall threshold",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "If a top surface has to be printed and it's partially covered by another layer, it won't be considered at a top layer where its width is below this value. This can be useful to not let the 'one perimeter on top' trigger on surface that should be covered only by perimeters. This value can be a mm or a % of the perimeter extrusion width.\nWarning: If enabled, artifacts can be created if you have some thin features on the next layer, like letters. Set this setting to 0 to remove these artifacts.",
      "wiki_page": "quality_settings_wall_and_surfaces#threshold"
    },
    "minimum_sparse_infill_area": {
      "type": "float",
      "label": "Minimum sparse infill threshold",
      "category": "Strength",
      "tooltip": "Sparse infill area which is smaller than threshold value is replaced by internal solid infill.",
      "default": "15",
      "wiki_page": "strength_settings_advanced#minimum-sparse-infill-threshold"
    },
    "minute": {
      "type": "int",
      "label": "Minute"
    },
    "mmu_segmented_region_interlocking_depth": {
      "type": "float",
      "label": "Interlocking depth of a segmented region",
      "category": "Advanced",
      "sidetext": "mm",
      "tooltip": "Interlocking depth of a segmented region. It will be ignored if \"mmu_segmented_region_max_width\" is zero or if \"mmu_segmented_region_interlocking_depth\" is bigger than \"mmu_segmented_region_max_width\". Zero disables this feature.",
      "default": "0.0",
      "wiki_page": "multimaterial_settings_advanced#interlocking-depth-of-segmented-region"
    },
    "mmu_segmented_region_max_width": {
      "type": "float",
      "label": "Maximum width of a segmented region",
      "category": "Advanced",
      "sidetext": "mm",
      "tooltip": "Maximum width of a segmented region. Zero disables this feature.",
      "default": "0.0",
      "wiki_page": "multimaterial_settings_advanced#maximum-width-of-segmented-region"
    },
    "month": {
      "type": "int",
      "label": "Month"
    },
    "mstpp": {
      "type": "int",
      "label": "mstpp",
      "tooltip": "max slicing time per plate in seconds.",
      "default": "300"
    },
    "mtcpp": {
      "type": "int",
      "label": "mtcpp",
      "tooltip": "max triangle count per plate for slicing.",
      "default": "1000000"
    },
    "no_check": {
      "type": "bool",
      "label": "No check",
      "tooltip": "Do not run any validity checks, such as G-code path conflicts check.",
      "default": "false"
    },
    "normal_print_time": {
      "type": "string",
      "label": "Print time (normal mode)",
      "tooltip": "Estimated print time when printed in normal mode (i.e. not in silent mode). Same as print_time."
    },
    "normative_check": {
      "type": "bool",
      "label": "Normative check",
      "tooltip": "Check the normative items.",
      "default": "true"
    },
    "notes": {
      "type": "string",
      "label": "Configuration notes",
      "tooltip": "You can put here your personal notes. This text will be added to the G-code header comments."
    },
    "nozzle_diameter": {
      "type": "float",
      "label": "Nozzle diameter",
      "sidetext": "mm",
      "tooltip": "The diameter of nozzle.",
      "wiki_page": "printer_extruder_basic_information#nozzle-diameter"
    },
    "nozzle_height": {
      "type": "float",
      "label": "Nozzle height",
      "sidetext": "mm",
      "tooltip": "The height of nozzle tip.",
      "default": "2.5"
    },
    "nozzle_hrc": {
      "type": "int",
      "label": "Nozzle HRC",
      "sidetext": "HRC",
      "tooltip": "The nozzle's hardness. Zero means no checking for nozzle's hardness during slicing.",
      "wiki_page": "printer_basic_information_accessory#nozzle-hrc"
    },
    "nozzle_temperature": {
      "type": "int",
      "label": "Other layers",
      "full_label": "Nozzle temperature",
      "tooltip": "Nozzle temperature for layers after the initial one.",
      "wiki_page": "material_temperatures#nozzle"
    },
    "nozzle_temperature_initial_layer": {
      "type": "int",
      "label": "Initial layer",
      "full_label": "Initial layer nozzle temperature",
      "tooltip": "Nozzle temperature for printing initial layer when using this filament.",
      "wiki_page": "material_temperatures#nozzle"
    },
    "nozzle_temperature_range_high": {
      "type": "int",
      "label": "Max",
      "tooltip": ""
    },
    "nozzle_temperature_range_low": {
      "type": "int",
      "label": "Min",
      "tooltip": ""
    },
    "nozzle_type": {
      "type": "coEnums",
      "label": "Nozzle type",
      "tooltip": "The metallic material of nozzle. This determines the abrasive resistance of nozzle, and what kind of filament can be printed.",
      "wiki_page": "printer_basic_information_accessory#nozzle-type"
    },
    "nozzle_volume": {
      "type": "float",
      "label": "Nozzle volume",
      "tooltip": "Volume of nozzle between the cutter and the end of nozzle.",
      "wiki_page": "printer_extruder_basic_information#nozzle-volume"
    },
    "num_extruders": {
      "type": "int",
      "label": "Number of extruders",
      "tooltip": "Total number of extruders, regardless of whether they are used in the current print."
    },
    "num_instances": {
      "type": "int",
      "label": "Number of instances",
      "tooltip": "Total number of object instances in the print, summed over all objects."
    },
    "num_objects": {
      "type": "int",
      "label": "Number of objects",
      "tooltip": "Total number of objects in the print."
    },
    "num_printing_extruders": {
      "type": "int",
      "label": "Number of printing extruders",
      "tooltip": "Number of extruders used during the print."
    },
    "only_one_wall_first_layer": {
      "type": "bool",
      "label": "Only one wall on first layer",
      "category": "Quality",
      "tooltip": "Use only one wall on first layer, to give more space to the bottom infill pattern.",
      "default": "false",
      "wiki_page": "quality_settings_wall_and_surfaces#only-one-wall"
    },
    "only_one_wall_top": {
      "type": "bool",
      "label": "Only one wall on top surfaces",
      "category": "Quality",
      "tooltip": "Use only one wall on flat top surfaces, to give more space to the top infill pattern.",
      "default": "false",
      "wiki_page": "quality_settings_wall_and_surfaces#only-one-wall"
    },
    "ooze_prevention": {
      "type": "bool",
      "label": "Enable",
      "tooltip": "This option will drop the temperature of the inactive extruders to prevent oozing.",
      "default": "false",
      "wiki_page": "multimaterial_settings_ooze_prevention"
    },
    "orient": {
      "type": "int",
      "label": "Orient Options",
      "tooltip": "Orient options: 0-disable, 1-enable, others-auto",
      "default": "0"
    },
    "other_layers_print_sequence": {
      "type": "int",
      "label": "Other layers print sequence"
    },
    "other_layers_print_sequence_nums": {
      "type": "int",
      "label": "The number of other layers print sequence"
    },
    "other_layers_sequence_choice": {
      "type": "enum",
      "label": "Other layers filament sequence",
      "category": "Quality"
    },
    "outer_wall_acceleration": {
      "type": "float",
      "label": "Outer wall",
      "category": "Speed",
      "tooltip": "Acceleration of outer wall. Using a lower value can improve quality.",
      "default": "500",
      "wiki_page": "speed_settings_acceleration#outer-wall"
    },
    "outer_wall_flow_ratio": {
      "type": "float",
      "label": "Outer wall flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for outer walls.\n\nThe actual outer wall flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "outer_wall_jerk": {
      "type": "float",
      "label": "Outer wall",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Jerk of outer walls.",
      "default": "9",
      "wiki_page": "speed_settings_jerk_xy#outer-wall"
    },
    "outer_wall_line_width": {
      "type": "coFloatOrPercent",
      "label": "Outer wall",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Line width of outer wall. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "outer_wall_speed": {
      "type": "float",
      "label": "Outer wall",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of outer wall which is outermost and visible. It's used to be slower than inner wall speed to get better quality.",
      "default": "60",
      "wiki_page": "speed_settings_other_layers_speed#outer-wall"
    },
    "output": {
      "type": "string",
      "label": "Output File",
      "tooltip": "The file where the output will be written (if not specified, it will be based on the input file)."
    },
    "outputdir": {
      "type": "string",
      "label": "Output directory",
      "tooltip": "Output directory for the exported files."
    },
    "overhang_1_4_speed": {
      "wiki_page": "speed_settings_overhang_speed#speed"
    },
    "overhang_2_4_speed": {
      "wiki_page": "speed_settings_overhang_speed#speed"
    },
    "overhang_3_4_speed": {
      "wiki_page": "speed_settings_overhang_speed#speed"
    },
    "overhang_4_4_speed": {
      "wiki_page": "speed_settings_overhang_speed#speed"
    },
    "overhang_fan_speed": {
      "type": "int",
      "label": "Overhangs and external bridges fan speed",
      "tooltip": "Use this part cooling fan speed when printing bridges or overhang walls with an overhang threshold that exceeds the value set in the 'Overhangs cooling threshold' parameter above. Increasing the cooling specifically for overhangs and bridges can improve the overall print quality of these features.\n\nPlease note, this fan speed is clamped on the lower end by the minimum fan speed threshold set above. It is also adjusted upwards up to the maximum fan speed threshold when the minimum layer time threshold is not met.",
      "wiki_page": "material_cooling#overhangs-and-external-bridges-fan-speed"
    },
    "overhang_fan_threshold": {
      "type": "coEnums",
      "label": "Overhang cooling activation threshold",
      "tooltip": "When the overhang exceeds this specified threshold, force the cooling fan to run at the 'Overhang Fan Speed' set below. This threshold is expressed as a percentage, indicating the portion of each line's width that is unsupported by the layer beneath it. Setting this value to 0% forces the cooling fan to run for all outer walls, regardless of the overhang degree.",
      "wiki_page": "material_cooling#overhang-cooling-activation-threshold"
    },
    "overhang_flow_ratio": {
      "type": "float",
      "label": "Overhang flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for overhangs.\n\nThe actual overhang flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "overhang_reverse": {
      "type": "bool",
      "label": "Reverse on even",
      "full_label": "Overhang reversal",
      "category": "Quality",
      "tooltip": "Extrude perimeters that have a part over an overhang in the reverse direction on even layers. This alternating pattern can drastically improve steep overhangs.\n\nThis setting can also help reduce part warping due to the reduction of stresses in the part walls.",
      "default": "false",
      "wiki_page": "quality_settings_overhangs#reverse-on-even"
    },
    "overhang_reverse_internal_only": {
      "type": "bool",
      "label": "Reverse only internal perimeters",
      "full_label": "Reverse only internal perimeters",
      "category": "Quality",
      "tooltip": "Apply the reverse perimeters logic only on internal perimeters.\n\nThis setting greatly reduces part stresses as they are now distributed in alternating directions. This should reduce part warping while also maintaining external wall quality. This feature can be very useful for warp prone material, like ABS/ASA, and also for elastic filaments, like TPU and Silk PLA. It can also help reduce warping on floating regions over supports.\n\nFor this setting to be the most effective, it is recommended to set the Reverse Threshold to 0 so that all internal walls print in alternating directions on even layers irrespective of their overhang degree.",
      "default": "false",
      "wiki_page": "quality_settings_overhangs#reverse-internal-only"
    },
    "overhang_reverse_threshold": {
      "type": "coFloatOrPercent",
      "label": "Reverse threshold",
      "full_label": "Overhang reversal threshold",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Number of mm the overhang need to be for the reversal to be considered useful. Can be a % of the perimeter width.\nValue 0 enables reversal on every even layers regardless.\nWhen Detect overhang wall is not enabled, this option is ignored and reversal happens on every even layers regardless.",
      "wiki_page": "quality_settings_overhangs#reverse-threshold"
    },
    "parking_pos_retraction": {
      "type": "float",
      "label": "Filament parking position",
      "sidetext": "mm",
      "tooltip": "Distance of the extruder tip from the position where the filament is parked when unloaded. This should match the value in printer firmware.",
      "default": "92.0",
      "wiki_page": "printer_multimaterial_semm_parameters#filament-parking-position"
    },
    "pellet_flow_coefficient": {
      "type": "float",
      "label": "Pellet flow coefficient",
      "tooltip": "Pellet flow coefficient is empirically derived and allows for volume calculation for pellet printers.\n\nInternally it is converted to filament_diameter. All other volume calculations remain the same.\n\nfilament_diameter = sqrt( (4 * pellet_flow_coefficient) / PI )",
      "wiki_page": "printer_basic_information_advanced#pellet-modded-printer"
    },
    "pellet_modded_printer": {
      "type": "bool",
      "label": "Pellet Modded Printer",
      "tooltip": "Enable this option if your printer uses pellets instead of filaments.",
      "default": "false",
      "wiki_page": "printer_basic_information_advanced#pellet-modded-printer"
    },
    "physical_printer_preset": {
      "type": "string",
      "label": "Physical printer name",
      "tooltip": "Name of the physical printer used for slicing."
    },
    "pipe": {
      "type": "string",
      "label": "Send progress to pipe",
      "tooltip": "Send progress to pipe."
    },
    "position": {
      "type": "float",
      "label": "Position",
      "tooltip": "Position of the extruder at the beginning of the custom G-code block. If the custom G-code travels somewhere else, it should write to this variable so OrcaSlicer knows where it travels from when it gets control back."
    },
    "post_process": {
      "type": "string",
      "label": "Post-processing Scripts",
      "tooltip": "If you want to process the output G-code through custom scripts, just list their absolute paths here. Separate multiple scripts with a semicolon. Scripts will be passed the absolute path to the G-code file as the first argument, and they can access the Orca Slicer config settings by reading environment variables."
    },
    "precise_outer_wall": {
      "type": "bool",
      "label": "Precise wall",
      "category": "Quality",
      "tooltip": "Improve shell precision by adjusting outer wall spacing. This also improves layer consistency. NOTE: This option will be ignored for outer-inner or inner-outer-inner wall sequences.",
      "wiki_page": "quality_settings_precision#precise-wall"
    },
    "precise_z_height": {
      "type": "bool",
      "label": "Precise Z height",
      "category": "Quality",
      "tooltip": "Enable this to get precise Z height of object after slicing. It will get the precise object height by fine-tuning the layer heights of the last few layers. Note that this is an experimental parameter.",
      "default": "0",
      "wiki_page": "quality_settings_precision#precise-z-height"
    },
    "preferred_orientation": {
      "type": "float",
      "label": "Preferred orientation",
      "tooltip": "Automatically orient STL files on the Z axis upon initial import.",
      "default": "0.0",
      "wiki_page": "printer_basic_information_printable_space#preferred-orientation"
    },
    "preheat_steps": {
      "type": "int",
      "label": "Preheat steps",
      "tooltip": "Insert multiple preheat commands (e.g. M104.1). Only useful for Prusa XL. For other printers, please set it to 1.",
      "default": "1",
      "wiki_page": "multimaterial_settings_ooze_prevention#preheat-steps"
    },
    "preheat_time": {
      "type": "float",
      "label": "Preheat time",
      "sidetext": "s",
      "tooltip": "To reduce the waiting time after tool change, Orca can preheat the next tool while the current tool is still in use. This setting specifies the time in seconds to preheat the next tool. Orca will insert a M104 command to preheat the tool in advance.",
      "default": "30.0",
      "wiki_page": "multimaterial_settings_ooze_prevention#preheat-time"
    },
    "preset_names": {
      "type": "string",
      "label": "Printer preset names",
      "tooltip": "Names of presets related to the physical printer."
    },
    "pressure_advance": {
      "type": "float",
      "label": "Pressure advance",
      "tooltip": "Pressure advance (Klipper) AKA Linear advance factor (Marlin).",
      "wiki_page": "material_flow_ratio_and_pressure_advance#pressure-advance"
    },
    "prime_tower_brim_width": {
      "type": "float",
      "label": "Brim width",
      "sidetext": "mm",
      "tooltip": "Brim width of prime tower, negative number means auto calculated width based on the height of prime tower.",
      "default": "3.0",
      "wiki_page": "multimaterial_settings_prime_tower#brim-width"
    },
    "prime_tower_enable_framework": {
      "type": "bool",
      "label": "Internal ribs",
      "tooltip": "Enable internal ribs to increase the stability of the prime tower.",
      "default": "false",
      "wiki_page": "multimaterial_settings_prime_tower"
    },
    "prime_tower_infill_gap": {
      "type": "percent",
      "label": "Infill gap",
      "tooltip": "Infill gap.",
      "default": "150",
      "wiki_page": "multimaterial_settings_prime_tower"
    },
    "prime_tower_skip_points": {
      "type": "bool",
      "label": "Skip points",
      "tooltip": "The wall of prime tower will skip the start points of wipe path.",
      "default": "true",
      "wiki_page": "multimaterial_settings_prime_tower"
    },
    "prime_tower_width": {
      "type": "float",
      "label": "Width",
      "sidetext": "mm",
      "tooltip": "Width of the prime tower.",
      "default": "60.0",
      "wiki_page": "multimaterial_settings_prime_tower#width"
    },
    "prime_volume": {
      "type": "float",
      "label": "Prime volume",
      "tooltip": "The volume of material to prime extruder on tower.",
      "default": "45.0",
      "wiki_page": "multimaterial_settings_prime_tower"
    },
    "print_bed_max": {
      "type": "float",
      "label": "Top-right corner of print bed bounding box"
    },
    "print_bed_min": {
      "type": "float",
      "label": "Bottom-left corner of print bed bounding box"
    },
    "print_bed_size": {
      "type": "float",
      "label": "Size of the print bed bounding box"
    },
    "print_flow_ratio": {
      "type": "float",
      "label": "Flow ratio",
      "category": "Quality",
      "tooltip": "The material may have volumetric change after switching between molten and crystalline states. This setting changes all extrusion flow of this filament in G-code proportionally. The recommended value range is between 0.95 and 1.05. You may be able to tune this value to get a nice flat surface if there is slight overflow or underflow.\n\nThe final object flow ratio is this value multiplied by the filament flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "print_host": {
      "type": "string",
      "label": "Hostname, IP or URL",
      "tooltip": "Orca Slicer can upload G-code files to a printer host. This field should contain the hostname, IP address or URL of the printer host instance. Print host behind HAProxy with basic auth enabled can be accessed by putting the user name and password into the URL in the following format: https://username:password@your-octopi-address/"
    },
    "print_host_webui": {
      "type": "string",
      "label": "Device UI",
      "tooltip": "Specify the URL of your device user interface if it's not same as print_host."
    },
    "print_order": {
      "type": "enum",
      "label": "Intra-layer order",
      "tooltip": "Print order within a single layer.",
      "wiki_page": "others_settings_special_mode#intra-layer-order"
    },
    "print_preset": {
      "type": "string",
      "label": "Print preset name",
      "tooltip": "Name of the print preset used for slicing."
    },
    "print_sequence": {
      "type": "enum",
      "label": "Print sequence",
      "tooltip": "Print sequence, layer by layer or object by object.",
      "wiki_page": "others_settings_special_mode#print-sequence"
    },
    "print_time": {
      "type": "string",
      "label": "Print time (normal mode)",
      "tooltip": "Estimated print time when printed in normal mode (i.e. not in silent mode). Same as normal_print_time."
    },
    "print_time_sec": {
      "type": "string",
      "label": "Print time (seconds)",
      "tooltip": "Total estimated print time in seconds. Replaced with actual value during post-processing."
    },
    "printable_area": {
      "type": "points",
      "label": "Printable area"
    },
    "printable_height": {
      "type": "float",
      "label": "Printable height",
      "sidetext": "mm",
      "tooltip": "Maximum printable height which is limited by mechanism of printer.",
      "default": "100.0",
      "wiki_page": "printer_basic_information_printable_space#printable-height"
    },
    "printer_agent": {
      "type": "string",
      "label": "Printer Agent",
      "tooltip": "Select the network agent implementation for printer communication."
    },
    "printer_model": {
      "type": "string",
      "label": "Printer type",
      "tooltip": "Type of the printer."
    },
    "printer_notes": {
      "type": "string",
      "label": "Printer notes",
      "tooltip": "You can put your notes regarding the printer here."
    },
    "printer_preset": {
      "type": "string",
      "label": "Printer preset name",
      "tooltip": "Name of the printer preset used for slicing."
    },
    "printer_structure": {
      "type": "enum",
      "label": "Printer structure",
      "tooltip": "The physical arrangement and components of a printing device.",
      "wiki_page": "printer_basic_information_advanced#printer-structure"
    },
    "printer_technology": {
      "type": "enum",
      "label": "Printer technology",
      "tooltip": "Printer technology."
    },
    "printer_variant": {
      "type": "string",
      "label": "Printer variant",
      "tooltip": "Name of the printer variant. For example, the printer variants may be differentiated by a nozzle diameter."
    },
    "printhost_apikey": {
      "type": "string",
      "label": "API Key / Password",
      "tooltip": "Orca Slicer can upload G-code files to a printer host. This field should contain the API Key or the password required for authentication."
    },
    "printhost_authorization_type": {
      "type": "enum",
      "label": "Authorization Type",
      "tooltip": ""
    },
    "printhost_cafile": {
      "type": "string",
      "label": "HTTPS CA File",
      "tooltip": "Custom CA certificate file can be specified for HTTPS OctoPrint connections, in crt/pem format. If left blank, the default OS CA certificate repository is used."
    },
    "printhost_password": {
      "type": "string",
      "label": "Password",
      "tooltip": ""
    },
    "printhost_port": {
      "type": "string",
      "label": "Printer",
      "tooltip": "Name of the printer."
    },
    "printhost_ssl_ignore_revoke": {
      "type": "bool",
      "label": "Ignore HTTPS certificate revocation checks",
      "tooltip": "Ignore HTTPS certificate revocation checks in case of missing or offline distribution points. One may want to enable this option for self signed certificates if connection fails.",
      "default": "false"
    },
    "printhost_user": {
      "type": "string",
      "label": "User",
      "tooltip": ""
    },
    "printing_by_object_gcode": {
      "type": "string",
      "label": "Between Object G-code",
      "tooltip": "Insert G-code between objects. This parameter will only come into effect when you print your models object by object."
    },
    "printing_filament_types": {
      "type": "string",
      "label": "Used filament types",
      "tooltip": "Comma-separated list of all filament types used during the print."
    },
    "purge_in_prime_tower": {
      "type": "bool",
      "label": "Purge in prime tower",
      "tooltip": "Purge remaining filament into prime tower.",
      "default": "true",
      "wiki_page": "printer_multimaterial_wipe_tower#purge-in-prime-tower"
    },
    "raft_contact_distance": {
      "type": "float",
      "label": "Raft contact Z distance",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Z gap between object and raft. Ignored for soluble interface.",
      "default": "0.1",
      "wiki_page": "support_settings_raft"
    },
    "raft_expansion": {
      "type": "float",
      "label": "Raft expansion",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Expand all raft layers in XY plane.",
      "default": "1.5"
    },
    "raft_first_layer_density": {
      "type": "percent",
      "label": "Initial layer density",
      "category": "Support",
      "tooltip": "Density of the first raft or support layer.",
      "default": "90",
      "wiki_page": "support_settings_support#initial-layer-density"
    },
    "raft_first_layer_expansion": {
      "type": "float",
      "label": "Initial layer expansion",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Expand the first raft or support layer to improve bed plate adhesion.",
      "default": "2.0",
      "wiki_page": "support_settings_support#initial-layer-expansion"
    },
    "raft_layers": {
      "type": "int",
      "label": "Raft layers",
      "category": "Support",
      "sidetext": "layers",
      "tooltip": "Object will be raised by this number of support layers. Use this function to avoid warping when printing ABS.",
      "default": "INITIAL_RAFT_LAYERS",
      "wiki_page": "support_settings_raft"
    },
    "reduce_crossing_wall": {
      "type": "bool",
      "label": "Avoid crossing walls",
      "category": "Quality",
      "tooltip": "Detour to avoid traveling across walls, which may cause blobs on the surface.",
      "default": "INITIAL_REDUCE_CROSSING_WALL",
      "wiki_page": "quality_settings_wall_and_surfaces#avoid-crossing-walls"
    },
    "reduce_fan_stop_start_freq": {
      "type": "bool",
      "label": "Keep fan always on",
      "tooltip": "Enabling this setting means that the part cooling fan will never stop completely and will run at least at minimum speed to reduce the frequency of starting and stopping.",
      "wiki_page": "material_cooling#keep-fan-always-on"
    },
    "reduce_infill_retraction": {
      "type": "bool",
      "label": "Reduce infill retraction",
      "tooltip": "Don't retract when the travel is entirely within an infill area. That means the oozing can't been seen. This can reduce times of retraction for complex model and save printing time, but make slicing and G-code generating slower. Note that z-hop is also not performed in areas where retraction is skipped.",
      "default": "false",
      "wiki_page": "others_settings_g_code_output#reduce-infill-retraction"
    },
    "repair": {
      "type": "bool",
      "label": "Repair",
      "tooltip": "Repair the model's meshes if it is non-manifold mesh.",
      "default": "false"
    },
    "repetitions": {
      "type": "int",
      "label": "Repetition count",
      "tooltip": "Repetition count of the whole model.",
      "default": "1"
    },
    "required_nozzle_HRC": {
      "type": "int",
      "label": "Required nozzle HRC",
      "tooltip": "Minimum HRC of nozzle required to print the filament. Zero means no checking of nozzle's HRC.",
      "wiki_page": "material_basic_information#required-nozzle-hrc"
    },
    "resolution": {
      "type": "float",
      "label": "Resolution",
      "sidetext": "mm",
      "tooltip": "The G-code path is generated after simplifying the contour of models to avoid too many points and G-code lines. Smaller value means higher resolution and more time to slice.",
      "default": "0.01",
      "wiki_page": "quality_settings_precision#resolution"
    },
    "resonance_avoidance": {
      "type": "bool",
      "label": "Resonance avoidance",
      "tooltip": "By reducing the speed of the outer wall to avoid the resonance zone of the printer, ringing on the surface of the model are avoided.\nPlease turn this option off when testing ringing.",
      "default": "false",
      "wiki_page": "printer_motion_ability#resonance-avoidance"
    },
    "retract_before_wipe": {
      "type": "percent",
      "label": "Retract amount before wipe",
      "tooltip": "The length of fast retraction before wipe, relative to retraction length.",
      "wiki_page": "printer_extruder_retraction#retract-amount-before-wipe"
    },
    "retract_length_toolchange": {
      "type": "float",
      "label": "Length",
      "full_label": "Retraction Length (Toolchange)",
      "sidetext": "mm",
      "tooltip": "When retraction is triggered before changing tool, filament is pulled back by the specified amount (the length is measured on raw filament, before it enters the extruder).",
      "wiki_page": "printer_extruder_retraction#retraction-when-switching-materials"
    },
    "retract_lift_above": {
      "type": "float",
      "label": "Only lift Z above",
      "sidetext": "mm",
      "tooltip": "If you set this to a positive value, Z lift will only take place above the specified absolute Z.",
      "wiki_page": "printer_extruder_z_hop#only-lift-z-above"
    },
    "retract_lift_below": {
      "type": "float",
      "label": "Only lift Z below",
      "sidetext": "mm",
      "tooltip": "If you set this to a positive value, Z lift will only take place below the specified absolute Z.",
      "wiki_page": "printer_extruder_z_hop#only-lift-z-below"
    },
    "retract_lift_enforce": {
      "type": "coEnums",
      "label": "On surfaces",
      "tooltip": "Enforce Z-Hop behavior. This setting is impacted by the above settings (Only lift Z above/below).",
      "wiki_page": "printer_extruder_z_hop#on-surfaces"
    },
    "retract_restart_extra": {
      "type": "float",
      "label": "Extra length on restart",
      "sidetext": "mm",
      "tooltip": "When the retraction is compensated after the travel move, the extruder will push this additional amount of filament. This setting is rarely needed.",
      "wiki_page": "printer_extruder_retraction#extra-length-on-restart"
    },
    "retract_restart_extra_toolchange": {
      "type": "float",
      "label": "Extra length on restart",
      "sidetext": "mm",
      "tooltip": "When the retraction is compensated after changing tool, the extruder will push this additional amount of filament.",
      "wiki_page": "printer_extruder_retraction#retraction-when-switching-materials"
    },
    "retract_when_changing_layer": {
      "type": "bool",
      "label": "Retract when change layer",
      "tooltip": "Force a retraction when changes layer.",
      "wiki_page": "printer_extruder_retraction#retract-on-layer-change"
    },
    "retraction_distances_when_cut": {
      "type": "float",
      "label": "Retraction distance when cut",
      "tooltip": "Experimental feature: Retraction length before cutting off during filament change.",
      "wiki_page": "printer_extruder_retraction#long-retraction-when-cut-beta"
    },
    "retraction_distances_when_ec": {
      "type": "float",
      "label": "Retraction distance when extruder change",
      "sidetext": "mm",
      "wiki_page": "material_multimaterial#multi-filament"
    },
    "retraction_length": {
      "type": "float",
      "label": "Length",
      "full_label": "Retraction Length",
      "sidetext": "mm",
      "tooltip": "Some amount of material in extruder is pulled back to avoid ooze during long travel. Set zero to disable retraction.",
      "wiki_page": "printer_extruder_retraction#length"
    },
    "retraction_minimum_travel": {
      "type": "float",
      "label": "Travel distance threshold",
      "sidetext": "mm",
      "tooltip": "Only trigger retraction when the travel distance is longer than this threshold.",
      "wiki_page": "printer_extruder_retraction#travel-distance-threshold"
    },
    "retraction_speed": {
      "type": "float",
      "label": "Retraction Speed",
      "full_label": "Retraction Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed for retracting filament from the nozzle.",
      "wiki_page": "printer_extruder_retraction#retraction-speed"
    },
    "role_based_wipe_speed": {
      "type": "bool",
      "label": "Role base wipe speed",
      "category": "Speed",
      "tooltip": "The wipe speed is determined by the speed of the current extrusion role. e.g. if a wipe action is executed immediately following an outer wall extrusion, the speed of the outer wall extrusion will be utilized for the wipe action.",
      "default": "true",
      "wiki_page": "quality_settings_seam#role-based-wipe-speed"
    },
    "rotate": {
      "type": "float",
      "label": "Rotate",
      "tooltip": "Rotation angle around the Z axis in degrees.",
      "default": "0"
    },
    "rotate_x": {
      "type": "float",
      "label": "Rotate around X",
      "tooltip": "Rotation angle around the X axis in degrees.",
      "default": "0"
    },
    "rotate_y": {
      "type": "float",
      "label": "Rotate around Y",
      "tooltip": "Rotation angle around the Y axis in degrees.",
      "default": "0"
    },
    "scale": {
      "type": "string",
      "label": "Scale per object",
      "tooltip": "Contains a string with the information about what scaling was applied to the individual objects. Indexing of the objects is zero-based (first object has index 0).\nExample: 'x:100% y:50% z:100%'."
    },
    "scale_to_fit": {
      "type": "coPoint3",
      "label": "Scale to Fit",
      "tooltip": "Scale to fit the given volume."
    },
    "scan_first_layer": {
      "type": "bool",
      "label": "Scan first layer",
      "tooltip": "Enable this to enable the camera on printer to check the quality of first layer.",
      "default": "false",
      "wiki_page": "printer_basic_information_advanced#scan-first-layer"
    },
    "scarf_angle_threshold": {
      "type": "int",
      "label": "Conditional angle threshold",
      "category": "Quality",
      "tooltip": "This option sets the threshold angle for applying a conditional scarf joint seam.\nIf the maximum angle within the perimeter loop exceeds this value (indicating the absence of sharp corners), a scarf joint seam will be used. The default value is 155°.",
      "default": "155",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "scarf_joint_flow_ratio": {
      "type": "float",
      "label": "Scarf joint flow ratio",
      "category": "Quality",
      "tooltip": "This factor affects the amount of material for scarf joints.",
      "default": "1",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "scarf_joint_speed": {
      "type": "coFloatOrPercent",
      "label": "Scarf joint speed",
      "category": "Quality",
      "sidetext": "mm/s or %",
      "tooltip": "This option sets the printing speed for scarf joints. It is recommended to print scarf joints at a slow speed (less than 100 mm/s). It's also advisable to enable 'Extrusion rate smoothing' if the set speed varies significantly from the speed of the outer or inner walls. If the speed specified here is higher than the speed of the outer or inner walls, the printer will default to the slower of the two speeds. When specified as a percentage (e.g., 80%), the speed is calculated based on the respective outer or inner wall speed. The default value is set to 100%.",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "scarf_overhang_threshold": {
      "type": "percent",
      "label": "Conditional overhang threshold",
      "category": "Quality",
      "tooltip": "This option determines the overhang threshold for the application of scarf joint seams. If the unsupported portion of the perimeter is less than this threshold, scarf joint seams will be applied. The default threshold is set at 40% of the external wall's width. Due to performance considerations, the degree of overhang is estimated.",
      "default": "40",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "seam_gap": {
      "type": "coFloatOrPercent",
      "label": "Seam gap",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "In order to reduce the visibility of the seam in a closed loop extrusion, the loop is interrupted and shortened by a specified amount.\nThis amount can be specified in millimeters or as a percentage of the current extruder diameter. The default value for this parameter is 10%.",
      "wiki_page": "quality_settings_seam#seam-gap"
    },
    "seam_position": {
      "type": "enum",
      "label": "Seam position",
      "category": "Quality",
      "tooltip": "The start position to print each part of outer wall.",
      "wiki_page": "quality_settings_seam#seam-position"
    },
    "seam_slope_conditional": {
      "type": "bool",
      "label": "Conditional scarf joint",
      "category": "Quality",
      "tooltip": "Apply scarf joints only to smooth perimeters where traditional seams do not conceal the seams at sharp corners effectively.",
      "default": "false",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "seam_slope_entire_loop": {
      "type": "bool",
      "label": "Scarf around entire wall",
      "category": "Quality",
      "tooltip": "The scarf extends to the entire length of the wall.",
      "default": "false",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "seam_slope_inner_walls": {
      "type": "bool",
      "label": "Scarf joint for inner walls",
      "category": "Quality",
      "tooltip": "Use scarf joint for inner walls as well.",
      "default": "false",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "seam_slope_min_length": {
      "type": "float",
      "label": "Scarf length",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Length of the scarf. Setting this parameter to zero effectively disables the scarf.",
      "default": "20",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "seam_slope_start_height": {
      "type": "coFloatOrPercent",
      "label": "Scarf start height",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Start height of the scarf.\nThis amount can be specified in millimeters or as a percentage of the current layer height. The default value for this parameter is 0.",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "seam_slope_steps": {
      "type": "int",
      "label": "Scarf steps",
      "category": "Quality",
      "tooltip": "Minimum number of segments of each scarf.",
      "default": "10",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "seam_slope_type": {
      "type": "enum",
      "label": "Scarf joint seam (beta)",
      "category": "Quality",
      "tooltip": "Use scarf joint to minimize seam visibility and increase seam strength.",
      "wiki_page": "quality_settings_seam#scarf-joint-seam"
    },
    "second": {
      "type": "int",
      "label": "Second"
    },
    "set_other_flow_ratios": {
      "type": "bool",
      "label": "Set other flow ratios",
      "category": "Advanced",
      "tooltip": "Change flow ratios for other extrusion path types.",
      "default": "false",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "silent_mode": {
      "type": "bool",
      "label": "Supports silent mode",
      "tooltip": "Whether the machine supports silent mode in which machine use lower acceleration to print.",
      "default": "false"
    },
    "silent_print_time": {
      "type": "string",
      "label": "Print time (silent mode)",
      "tooltip": "Estimated print time when printed in silent mode."
    },
    "single_extruder_multi_material": {
      "type": "bool",
      "label": "Single Extruder Multi Material",
      "tooltip": "Use single nozzle to print multi filament.",
      "default": "true",
      "wiki_page": "printer_multimaterial_setup#single-extruder-multi-material"
    },
    "single_extruder_multi_material_priming": {
      "type": "bool",
      "label": "Prime all printing extruders",
      "tooltip": "If enabled, all printing extruders will be primed at the front edge of the print bed at the start of the print.",
      "default": "false",
      "wiki_page": "multimaterial_settings_prime_tower"
    },
    "single_instance": {
      "type": "bool",
      "label": "Single instance mode",
      "tooltip": "If enabled, the command line arguments are sent to an existing instance of GUI OrcaSlicer, or an existing OrcaSlicer window is activated. Overrides the \"single_instance\" configuration value from application preferences."
    },
    "single_loop_draft_shield": {
      "type": "bool",
      "label": "Single loop after first layer",
      "tooltip": "Limits the skirt/draft shield loops to one wall after the first layer. This is useful, on occasion, to conserve filament but may cause the draft shield/skirt to warp / crack.",
      "default": "false",
      "wiki_page": "others_settings_skirt#single-loop-after-first-layer"
    },
    "skeleton_infill_density": {
      "type": "percent",
      "label": "Skeleton infill density",
      "category": "Strength",
      "tooltip": "The remaining part of the model contour after removing a certain depth from the surface is called the skeleton. This parameter is used to adjust the density of this section. When two regions have the same sparse infill settings but different skeleton densities, their skeleton areas will develop overlapping sections. Default is as same as infill density.",
      "default": "25",
      "wiki_page": "strength_settings_patterns#locked-zag"
    },
    "skeleton_infill_line_width": {
      "type": "coFloatOrPercent",
      "label": "Skeleton line width",
      "category": "Strength",
      "sidetext": "mm",
      "tooltip": "Adjust the line width of the selected skeleton paths.",
      "wiki_page": "strength_settings_patterns#locked-zag"
    },
    "skin_infill_density": {
      "type": "percent",
      "label": "Skin infill density",
      "category": "Strength",
      "tooltip": "The portion of the model's outer surface within a certain depth range is called the skin. This parameter is used to adjust the density of this section. When two regions have the same sparse infill settings but different skin densities, this area will not be split into two separate regions. Default is as same as infill density.",
      "default": "25",
      "wiki_page": "strength_settings_patterns#locked-zag"
    },
    "skin_infill_depth": {
      "type": "float",
      "label": "Skin infill depth",
      "category": "Strength",
      "sidetext": "mm",
      "tooltip": "The parameter sets the depth of skin.",
      "default": "2.0",
      "wiki_page": "strength_settings_patterns#locked-zag"
    },
    "skin_infill_line_width": {
      "type": "coFloatOrPercent",
      "label": "Skin line width",
      "category": "Strength",
      "sidetext": "mm",
      "tooltip": "Adjust the line width of the selected skin paths.",
      "wiki_page": "strength_settings_patterns#locked-zag"
    },
    "skip_modified_gcodes": {
      "type": "bool",
      "label": "Skip modified G-code in 3MF",
      "tooltip": "Skip the modified G-code in 3MF from printer or filament presets.",
      "default": "false"
    },
    "skip_objects": {
      "type": "int",
      "label": "Skip Objects",
      "tooltip": "Skip some objects in this print."
    },
    "skirt_distance": {
      "type": "float",
      "label": "Skirt distance",
      "sidetext": "mm",
      "tooltip": "The distance from the skirt to the brim or the object.",
      "default": "2",
      "wiki_page": "others_settings_skirt#distance"
    },
    "skirt_height": {
      "type": "int",
      "label": "Skirt height",
      "sidetext": "layers",
      "tooltip": "How many layers of skirt. Usually only one layer.",
      "default": "1",
      "wiki_page": "others_settings_skirt#height"
    },
    "skirt_loops": {
      "type": "int",
      "label": "Skirt loops",
      "full_label": "Skirt loops",
      "tooltip": "Number of loops for the skirt. Zero means disabling skirt.",
      "default": "1",
      "wiki_page": "others_settings_skirt#loops"
    },
    "skirt_speed": {
      "type": "float",
      "label": "Skirt speed",
      "full_label": "Skirt speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of skirt, in mm/s. Zero means use default layer extrusion speed.",
      "default": "50.0",
      "wiki_page": "others_settings_skirt#speed"
    },
    "skirt_start_angle": {
      "type": "float",
      "label": "Skirt start point",
      "category": "Support",
      "tooltip": "Angle from the object center to skirt start point. Zero is the most right position, counter clockwise is positive angle.",
      "default": "-135",
      "wiki_page": "others_settings_skirt#start-point"
    },
    "skirt_type": {
      "type": "enum",
      "label": "Skirt type",
      "full_label": "Skirt type",
      "tooltip": "Combined - single skirt for all objects, Per object - individual object skirt.",
      "wiki_page": "others_settings_skirt#type"
    },
    "slice": {
      "type": "int",
      "label": "Slice",
      "tooltip": "Slice the plates: 0-all plates, i-plate i, others-invalid",
      "default": "0"
    },
    "slice_closing_radius": {
      "type": "float",
      "label": "Slice gap closing radius",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Cracks smaller than 2x gap closing radius are being filled during the triangle mesh slicing. The gap closing operation may reduce the final print resolution, therefore it is advisable to keep the value reasonably low.",
      "default": "0.049",
      "wiki_page": "quality_settings_precision#slice-gap-closing-radius"
    },
    "slicing_mode": {
      "type": "enum",
      "label": "Slicing Mode",
      "category": "Other",
      "tooltip": "Use \"Even-odd\" for 3DLabPrint airplane models. Use \"Close holes\" to close all holes in the model.",
      "wiki_page": "others_settings_special_mode#slicing-mode"
    },
    "slow_down_for_layer_cooling": {
      "type": "bool",
      "label": "Slow printing down for better layer cooling",
      "tooltip": "Enable this option to slow printing speed down to make the final layer time not shorter than the layer time threshold in \"Max fan speed threshold\", so that layer can be cooled for longer time. This can improve the cooling quality for needle and small details.",
      "wiki_page": "material_cooling#slow-printing-down-for-better-layer-cooling"
    },
    "slow_down_layer_time": {
      "type": "float",
      "label": "Layer time",
      "sidetext": "s",
      "tooltip": "The printing speed in exported G-code will be slowed down when the estimated layer time is shorter than this value in order to get better cooling for these layers.",
      "wiki_page": "material_cooling#material-part-cooling-fan"
    },
    "slow_down_layers": {
      "type": "int",
      "label": "Number of slow layers",
      "category": "Speed",
      "sidetext": "layers",
      "tooltip": "The first few layers are printed slower than normal. The speed is gradually increased in a linear fashion over the specified number of layers.",
      "default": "0",
      "wiki_page": "speed_settings_initial_layer_speed#number-of-slow-layers"
    },
    "slow_down_min_speed": {
      "type": "float",
      "label": "Min print speed",
      "sidetext": "mm/s",
      "tooltip": "The minimum print speed to which the printer slows down to maintain the minimum layer time defined above when the slowdown for better layer cooling is enabled.",
      "wiki_page": "material_cooling#min-print-speed"
    },
    "slowdown_for_curled_perimeters": {
      "type": "bool",
      "label": "Slow down for curled perimeters",
      "category": "Speed",
      "tooltip": "Enable this option to slow down printing in areas where perimeters may have curled upwards. For example, additional slowdown will be applied when printing overhangs on sharp corners like the front of the Benchy hull, reducing curling which compounds over multiple layers.\n\nIt is generally recommended to have this option switched on unless your printer cooling is powerful enough or the print speed slow enough that perimeter curling does not happen. If printing with a high external perimeter speed, this parameter may introduce slight artifacts when slowing down due to the large variance in print speeds. If you notice artifacts, ensure your pressure advance is tuned correctly.\n\nNote: When this option is enabled, overhang perimeters are treated like overhangs, meaning the overhang speed is applied even if the overhanging perimeter is part of a bridge. For example, when the perimeters are 100% overhanging, with no wall supporting them from underneath, the 100% overhang speed will be applied.",
      "wiki_page": "speed_settings_overhang_speed#slow-down-for-curled-perimeters"
    },
    "small_area_infill_flow_compensation": {
      "type": "bool",
      "label": "Small area flow compensation (beta)",
      "category": "Quality",
      "tooltip": "Enable flow compensation for small infill areas.",
      "default": "false",
      "wiki_page": "quality_settings_wall_and_surfaces#small-area-flow-compensation"
    },
    "small_area_infill_flow_compensation_model": {
      "type": "string",
      "label": "Flow Compensation Model",
      "tooltip": "Flow Compensation Model, used to adjust the flow for small infill areas. The model is expressed as a comma separated pair of values for extrusion length and flow correction factor. Each pair is on a separate line, followed by a semicolon, in the following format: \"1.234, 5.678;\""
    },
    "small_perimeter_speed": {
      "type": "coFloatOrPercent",
      "label": "Small perimeters",
      "category": "Speed",
      "sidetext": "mm/s or %",
      "tooltip": "This separate setting will affect the speed of perimeters having radius <= small_perimeter_threshold (usually holes). If expressed as percentage (for example: 80%) it will be calculated on the outer wall speed setting above. Set to zero for auto.",
      "wiki_page": "speed_settings_other_layers_speed#small-perimeters"
    },
    "small_perimeter_threshold": {
      "type": "float",
      "label": "Small perimeters threshold",
      "category": "Speed",
      "sidetext": "mm",
      "tooltip": "This sets the threshold for small perimeter length. Default threshold is 0mm.",
      "default": "0",
      "wiki_page": "speed_settings_other_layers_speed#small-perimeters-threshold"
    },
    "solid_infill_direction": {
      "type": "float",
      "label": "Solid infill direction",
      "category": "Strength",
      "tooltip": "Angle for solid infill pattern, which controls the start or main direction of line.",
      "default": "45",
      "wiki_page": "strength_settings_infill#direction"
    },
    "solid_infill_filament": {
      "type": "int",
      "label": "Solid infill",
      "category": "Extruders",
      "tooltip": "Filament to print solid infill.",
      "default": "1",
      "wiki_page": "multimaterial_settings_filament_for_features#solid-infill"
    },
    "solid_infill_rotate_template": {
      "type": "string",
      "label": "Solid infill rotation template",
      "category": "Strength",
      "tooltip": "This parameter adds a rotation of solid infill direction to each layer according to the specified template. The template is a comma-separated list of angles in degrees, e.g. '0,90'. The first angle is applied to the first layer, the second angle to the second layer, and so on. If there are more layers than angles, the angles will be repeated. Note that not all solid infill patterns support rotation.",
      "wiki_page": "strength_settings_infill_rotation_template_metalanguage"
    },
    "spaghetti_detector": {
      "type": "bool",
      "label": "Enable spaghetti detector",
      "tooltip": "Enable the camera on printer to check spaghetti.",
      "default": "false"
    },
    "sparse_infill_acceleration": {
      "type": "coFloatOrPercent",
      "label": "Sparse infill",
      "category": "Speed",
      "sidetext": "mm/s² or %",
      "tooltip": "Acceleration of sparse infill. If the value is expressed as a percentage (e.g. 100%), it will be calculated based on the default acceleration.",
      "wiki_page": "speed_settings_acceleration#sparse-infill"
    },
    "sparse_infill_density": {
      "type": "percent",
      "label": "Sparse infill density",
      "category": "Strength",
      "tooltip": "Density of internal sparse infill, 100% turns all sparse infill into solid infill and internal solid infill pattern will be used.",
      "default": "20",
      "wiki_page": "strength_settings_infill#sparse-infill-density"
    },
    "sparse_infill_filament": {
      "type": "int",
      "label": "Infill",
      "category": "Extruders",
      "tooltip": "Filament to print internal sparse infill.",
      "default": "1",
      "wiki_page": "multimaterial_settings_filament_for_features#infill"
    },
    "sparse_infill_flow_ratio": {
      "type": "float",
      "label": "Sparse infill flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for sparse infill.\n\nThe actual sparse infill flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "sparse_infill_line_width": {
      "type": "coFloatOrPercent",
      "label": "Sparse infill",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Line width of internal sparse infill. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "sparse_infill_pattern": {
      "type": "enum",
      "label": "Sparse infill pattern",
      "category": "Strength",
      "tooltip": "Line pattern for internal sparse infill.",
      "wiki_page": "strength_settings_infill#sparse-infill-pattern"
    },
    "sparse_infill_rotate_template": {
      "type": "string",
      "label": "Sparse infill rotation template",
      "category": "Strength",
      "tooltip": "Rotate the sparse infill direction per layer using a template of angles. Enter comma-separated degrees (e.g., '0,30,60,90'). Angles are applied in order by layer and repeat when the list ends. Advanced syntax is supported: '+5' rotates +5° every layer; '+5#5' rotates +5° every 5 layers. See the Wiki for details. When a template is set, the standard infill direction setting is ignored. Note: some infill patterns (e.g., Gyroid) control rotation themselves; use with care.",
      "wiki_page": "strength_settings_infill_rotation_template_metalanguage"
    },
    "sparse_infill_speed": {
      "type": "float",
      "label": "Sparse infill",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of internal sparse infill.",
      "default": "100",
      "wiki_page": "speed_settings_other_layers_speed#sparse-infill"
    },
    "spiral_finishing_flow_ratio": {
      "type": "float",
      "label": "Spiral finishing flow ratio",
      "tooltip": "Sets the finishing flow ratio while ending the spiral. Normally the spiral transition scales the flow ratio from 100% to 0% during the last loop which can in some cases lead to under extrusion at the end of the spiral.",
      "default": "0",
      "wiki_page": "others_settings_special_mode#spiral-finishing-flow-ratio"
    },
    "spiral_mode": {
      "type": "bool",
      "label": "Spiral vase",
      "tooltip": "Spiralize smooths out the Z moves of the outer contour. And turns a solid model into a single walled print with solid bottom layers. The final generated model has no seam.",
      "default": "false",
      "wiki_page": "others_settings_special_mode#spiral-vase"
    },
    "spiral_mode_max_xy_smoothing": {
      "type": "coFloatOrPercent",
      "label": "Max XY Smoothing",
      "sidetext": "mm or %",
      "tooltip": "Maximum distance to move points in XY to try to achieve a smooth spiral. If expressed as a %, it will be computed over nozzle diameter.",
      "wiki_page": "others_settings_special_mode#max-xy-smoothing"
    },
    "spiral_mode_smooth": {
      "type": "bool",
      "label": "Smooth Spiral",
      "tooltip": "Smooth Spiral smooths out X and Y moves as well, resulting in no visible seam at all, even in the XY directions on walls that are not vertical.",
      "default": "false",
      "wiki_page": "others_settings_special_mode#smooth-spiral"
    },
    "spiral_starting_flow_ratio": {
      "type": "float",
      "label": "Spiral starting flow ratio",
      "tooltip": "Sets the starting flow ratio while transitioning from the last bottom layer to the spiral. Normally the spiral transition scales the flow ratio from 0% to 100% during the first loop which can in some cases lead to under extrusion at the start of the spiral.",
      "default": "0",
      "wiki_page": "others_settings_special_mode#spiral-starting-flow-ratio"
    },
    "split": {
      "type": "bool",
      "label": "Split",
      "tooltip": "Detect unconnected parts in the given model(s) and split them into separate objects."
    },
    "staggered_inner_seams": {
      "type": "bool",
      "label": "Staggered inner seams",
      "category": "Quality",
      "tooltip": "This option causes the inner seams to be shifted backwards based on their depth, forming a zigzag pattern.",
      "default": "false",
      "wiki_page": "quality_settings_seam#staggered-inner-seams"
    },
    "standby_temperature_delta": {
      "type": "int",
      "label": "Temperature variation",
      "tooltip": "Temperature difference to be applied when an extruder is not active. The value is not used when 'idle_temperature' in filament settings is set to non-zero value.",
      "default": "-5",
      "wiki_page": "multimaterial_settings_ooze_prevention#temperature-variation"
    },
    "start_end_points": {
      "type": "points",
      "label": "Start end points",
      "tooltip": "The start and end points which is from cutter area to garbage can."
    },
    "supertack_plate_temp": {
      "type": "int",
      "label": "Other layers",
      "full_label": "Bed temperature",
      "tooltip": "Bed temperature for layers except the initial one. A value of 0 means the filament does not support printing on the Cool Plate SuperTack.",
      "wiki_page": "material_temperatures#bed"
    },
    "supertack_plate_temp_initial_layer": {
      "type": "int",
      "label": "Initial layer",
      "full_label": "Initial layer bed temperature",
      "tooltip": "Bed temperature of the initial layer. A value of 0 means the filament does not support printing on the Cool Plate SuperTack.",
      "wiki_page": "material_temperatures#bed"
    },
    "support_air_filtration": {
      "type": "bool",
      "label": "Support air filtration",
      "tooltip": "Enable this if printer support air filtration\nG-code command: M106 P3 S(0-255)",
      "default": "true",
      "wiki_page": "printer_basic_information_accessory#support-air-filtration"
    },
    "support_angle": {
      "type": "float",
      "label": "Pattern angle",
      "category": "Support",
      "tooltip": "Use this setting to rotate the support pattern on the horizontal plane.",
      "default": "0",
      "wiki_page": "support_settings_advanced#pattern-angle"
    },
    "support_base_pattern": {
      "type": "enum",
      "label": "Base pattern",
      "category": "Support",
      "tooltip": "Line pattern of support.",
      "wiki_page": "support_settings_advanced#base-pattern"
    },
    "support_base_pattern_spacing": {
      "type": "float",
      "label": "Base pattern spacing",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Spacing between support lines.",
      "default": "2.5",
      "wiki_page": "support_settings_advanced#base-pattern-spacing"
    },
    "support_bottom_interface_spacing": {
      "type": "float",
      "label": "Bottom interface spacing",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Spacing of bottom interface lines. Zero means solid interface.",
      "default": "0.5",
      "wiki_page": "support_settings_advanced#interface-spacing"
    },
    "support_bottom_z_distance": {
      "type": "float",
      "label": "Bottom Z distance",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "The Z gap between the bottom support interface and object.",
      "default": "0.2",
      "wiki_page": "support_settings_advanced#z-distance"
    },
    "support_chamber_temp_control": {
      "type": "bool",
      "label": "Support control chamber temperature",
      "tooltip": "This option is enabled if machine support controlling chamber temperature\nG-code command: M141 S(0-255)",
      "default": "true",
      "wiki_page": "printer_basic_information_accessory#support-controlling-chamber-temperature"
    },
    "support_critical_regions_only": {
      "type": "bool",
      "label": "Support critical regions only",
      "category": "Support",
      "tooltip": "Only create support for critical regions including sharp tail, cantilever, etc.",
      "default": "false",
      "wiki_page": "support_settings_support#support-critical-regions-only"
    },
    "support_expansion": {
      "type": "float",
      "label": "Normal Support expansion",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Expand (+) or shrink (-) the horizontal span of normal support.",
      "default": "0",
      "wiki_page": "support_settings_advanced#normal-support-expansion"
    },
    "support_filament": {
      "type": "int",
      "label": "Support/raft base",
      "category": "Support",
      "tooltip": "Filament to print support base and raft. \"Default\" means no specific filament for support and current filament is used.",
      "default": "0",
      "wiki_page": "support_settings_filament#base"
    },
    "support_flow_ratio": {
      "type": "float",
      "label": "Support flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for support.\n\nThe actual support flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "support_interface_bottom_layers": {
      "type": "int",
      "label": "Bottom interface layers",
      "category": "Support",
      "sidetext": "layers",
      "tooltip": "Number of bottom interface layers.",
      "default": "0",
      "wiki_page": "support_settings_advanced#interface-layers"
    },
    "support_interface_filament": {
      "type": "int",
      "label": "Support/raft interface",
      "category": "Support",
      "tooltip": "Filament to print support interface. \"Default\" means no specific filament for support interface and current filament is used.",
      "default": "0",
      "wiki_page": "support_settings_filament#interface"
    },
    "support_interface_flow_ratio": {
      "type": "float",
      "label": "Support interface flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for the support interface.\n\nThe actual support interface flow used is calculated by multiplying this value by the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "support_interface_loop_pattern": {
      "type": "bool",
      "label": "Interface use loop pattern",
      "category": "Support",
      "tooltip": "Cover the top contact layer of the supports with loops. Disabled by default.",
      "default": "false",
      "wiki_page": "support_settings_advanced"
    },
    "support_interface_not_for_body": {
      "type": "bool",
      "label": "Avoid interface filament for base",
      "category": "Support",
      "tooltip": "Avoid using support interface filament to print support base if possible.",
      "default": "true",
      "wiki_page": "support_settings_filament#avoid-interface-filament-for-base"
    },
    "support_interface_pattern": {
      "type": "enum",
      "label": "Interface pattern",
      "category": "Support",
      "tooltip": "Line pattern of support interface. Default pattern for non-soluble support interface is Rectilinear, while default pattern for soluble support interface is Concentric.",
      "wiki_page": "support_settings_advanced#interface-pattern"
    },
    "support_interface_spacing": {
      "type": "float",
      "label": "Top interface spacing",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Spacing of interface lines. Zero means solid interface.\nForce using solid interface when support ironing is enabled.",
      "default": "0.5",
      "wiki_page": "support_settings_advanced#interface-spacing"
    },
    "support_interface_speed": {
      "type": "float",
      "label": "Support interface",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of support interface.",
      "default": "80",
      "wiki_page": "speed_settings_other_layers_speed#support-interface"
    },
    "support_interface_top_layers": {
      "type": "int",
      "label": "Top interface layers",
      "category": "Support",
      "sidetext": "layers",
      "tooltip": "Number of top interface layers.",
      "default": "3",
      "wiki_page": "support_settings_advanced#interface-layers"
    },
    "support_ironing": {
      "type": "bool",
      "label": "Ironing Support Interface",
      "category": "Support",
      "tooltip": "Ironing is using small flow to print on same height of support interface again to make it more smooth. This setting controls whether support interface being ironed. When enabled, support interface will be extruded as solid too.",
      "default": "false",
      "wiki_page": "support_settings_ironing"
    },
    "support_ironing_flow": {
      "type": "percent",
      "label": "Support Ironing flow",
      "category": "Support",
      "tooltip": "The amount of material to extrude during ironing. Relative to flow of normal support interface layer height. Too high value results in overextrusion on the surface.",
      "default": "10",
      "wiki_page": "support_settings_ironing#flow"
    },
    "support_ironing_pattern": {
      "type": "enum",
      "label": "Support Ironing Pattern",
      "category": "Support",
      "tooltip": "The pattern that will be used when ironing.",
      "wiki_page": "support_settings_ironing#pattern"
    },
    "support_ironing_spacing": {
      "type": "float",
      "label": "Support Ironing line spacing",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "The distance between the lines of ironing.",
      "default": "0.1",
      "wiki_page": "support_settings_ironing#line-spacing"
    },
    "support_line_width": {
      "type": "coFloatOrPercent",
      "label": "Support",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Line width of support. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "support_material_interface_fan_speed": {
      "type": "int",
      "label": "Support interface fan speed",
      "tooltip": "This part cooling fan speed is applied when printing support interfaces. Setting this parameter to a higher than regular speed reduces the layer binding strength between supports and the supported part, making them easier to separate.\nSet to -1 to disable it.\nThis setting is overridden by disable_fan_first_layers.",
      "wiki_page": "material_cooling#support-interface-fan-speed"
    },
    "support_multi_bed_types": {
      "type": "bool",
      "label": "Support multi bed types",
      "tooltip": "Enable this option if you want to use multiple bed types.",
      "default": "false",
      "wiki_page": "printer_basic_information_printable_space#support-multi-bed-types"
    },
    "support_object_first_layer_gap": {
      "type": "float",
      "label": "Support/object first layer gap",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "XY separation between an object and its support at the first layer.",
      "default": "0.2",
      "wiki_page": "support_settings_advanced#supportobject-first-layer-gap"
    },
    "support_object_xy_distance": {
      "type": "float",
      "label": "Support/object XY distance",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "XY separation between an object and its support.",
      "default": "0.35",
      "wiki_page": "support_settings_advanced#supportobject-xy-distance"
    },
    "support_on_build_plate_only": {
      "type": "bool",
      "label": "On build plate only",
      "category": "Support",
      "tooltip": "Don't create support on model surface, only on build plate.",
      "default": "false",
      "wiki_page": "support_settings_support#on-build-plate-only"
    },
    "support_remove_small_overhang": {
      "type": "bool",
      "label": "Ignore small overhangs",
      "category": "Support",
      "tooltip": "Ignore small overhangs that possibly don't require support.",
      "default": "true",
      "wiki_page": "support_settings_support#ignore-small-overhangs"
    },
    "support_speed": {
      "type": "float",
      "label": "Support",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of support.",
      "default": "80",
      "wiki_page": "speed_settings_other_layers_speed#support"
    },
    "support_style": {
      "type": "enum",
      "label": "Style",
      "category": "Support",
      "tooltip": "Style and shape of the support. For normal support, projecting the supports into a regular grid will create more stable supports (default), while snug support towers will save material and reduce object scarring.\nFor tree support, slim and organic style will merge branches more aggressively and save a lot of material (default organic), while hybrid style will create similar structure to normal support under large flat overhangs.",
      "wiki_page": "support_settings_support#style"
    },
    "support_threshold_angle": {
      "type": "int",
      "label": "Threshold angle",
      "category": "Support",
      "tooltip": "Support will be generated for overhangs whose slope angle is below the threshold.",
      "default": "30",
      "wiki_page": "support_settings_support#threshold-angle"
    },
    "support_threshold_overlap": {
      "type": "coFloatOrPercent",
      "label": "Threshold overlap",
      "category": "Support",
      "sidetext": "mm or %",
      "tooltip": "If threshold angle is zero, support will be generated for overhangs whose overlap is below the threshold. The smaller this value is, the steeper the overhang that can be printed without support.",
      "wiki_page": "support_settings_support#threshold-overlap"
    },
    "support_top_z_distance": {
      "type": "float",
      "label": "Top Z distance",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "The Z gap between the top support interface and object.",
      "default": "0.2",
      "wiki_page": "support_settings_advanced#z-distance"
    },
    "support_type": {
      "type": "enum",
      "label": "Type",
      "category": "Support",
      "tooltip": "Normal (auto) and Tree (auto) are used to generate support automatically. If Normal (manual) or Tree (manual) is selected, only support enforcers are generated.",
      "wiki_page": "support_settings_support#type"
    },
    "sw_renderer": {
      "type": "bool",
      "label": "Render with a software renderer",
      "tooltip": "Render with a software renderer. The bundled MESA software renderer is loaded instead of the default OpenGL driver."
    },
    "symmetric_infill_y_axis": {
      "type": "bool",
      "label": "Symmetric infill Y axis",
      "category": "Strength",
      "tooltip": "If the model has two parts that are symmetric about the Y axis, and you want these parts to have symmetric textures, please click this option on one of the parts.",
      "default": "false",
      "wiki_page": "strength_settings_infill#symmetric-infill-y-axis"
    },
    "temperature_vitrification": {
      "type": "int",
      "label": "Softening temperature",
      "tooltip": "The material softens at this temperature, so when the bed temperature is equal to or greater than this, it's highly recommended to open the front door and/or remove the upper glass to avoid clogging.",
      "wiki_page": "material_basic_information#softening-temperature"
    },
    "template_custom_gcode": {
      "type": "string",
      "label": "Custom G-code",
      "tooltip": "This G-code will be used as a custom code."
    },
    "textured_cool_plate_temp": {
      "type": "int",
      "label": "Other layers",
      "full_label": "Bed temperature",
      "tooltip": "Bed temperature for layers except the initial one. A value of 0 means the filament does not support printing on the Textured Cool Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "textured_cool_plate_temp_initial_layer": {
      "type": "int",
      "label": "Initial layer",
      "full_label": "Initial layer bed temperature",
      "tooltip": "Bed temperature of the initial layer. A value of 0 means the filament does not support printing on the Textured Cool Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "textured_plate_temp": {
      "type": "int",
      "label": "Other layers",
      "full_label": "Bed temperature",
      "tooltip": "Bed temperature for layers except the initial one. A value of 0 means the filament does not support printing on the Textured PEI Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "textured_plate_temp_initial_layer": {
      "type": "int",
      "label": "Initial layer",
      "full_label": "Initial layer bed temperature",
      "tooltip": "Bed temperature of the initial layer. A value of 0 means the filament does not support printing on the Textured PEI Plate.",
      "wiki_page": "material_temperatures#bed"
    },
    "thick_bridges": {
      "type": "bool",
      "label": "Thick external bridges",
      "category": "Quality",
      "tooltip": "If enabled, bridges are more reliable, can bridge longer distances, but may look worse. If disabled, bridges look better but are reliable just for shorter bridged distances.",
      "default": "false",
      "wiki_page": "quality_settings_bridging#thick-bridges"
    },
    "thick_internal_bridges": {
      "type": "bool",
      "label": "Thick internal bridges",
      "category": "Quality",
      "tooltip": "If enabled, thick internal bridges will be used. It's usually recommended to have this feature turned on. However, consider turning it off if you are using large nozzles.",
      "default": "true",
      "wiki_page": "quality_settings_bridging#thick-bridges"
    },
    "thumbnails": {
      "type": "string",
      "label": "G-code thumbnails",
      "tooltip": "Picture sizes to be stored into a .gcode and .sl1 / .sl1s files, in the following format: \"XxY, XxY, ...\""
    },
    "thumbnails_format": {
      "type": "enum",
      "label": "Format of G-code thumbnails",
      "tooltip": "Format of G-code thumbnails: PNG for best quality, JPG for smallest size, QOI for low memory firmware."
    },
    "time_cost": {
      "type": "float",
      "label": "Time cost",
      "sidetext": "money/h",
      "tooltip": "The printer cost per hour.",
      "default": "0",
      "wiki_page": "printer_basic_information_advanced#time-cost"
    },
    "time_lapse_gcode": {
      "type": "string",
      "label": "Timelapse G-code"
    },
    "timelapse_type": {
      "type": "enum",
      "label": "Timelapse",
      "tooltip": "If smooth or traditional mode is selected, a timelapse video will be generated for each print. After each layer is printed, a snapshot is taken with the chamber camera. All of these snapshots are composed into a timelapse video when printing completes. If smooth mode is selected, the toolhead will move to the excess chute after each layer is printed and then take a snapshot. Since the melt filament may leak from the nozzle during the process of taking a snapshot, prime tower is required for smooth mode to wipe nozzle.",
      "wiki_page": "others_settings_special_mode#timelapse"
    },
    "timestamp": {
      "type": "string",
      "label": "Timestamp",
      "tooltip": "String containing current time in yyyyMMdd-hhmmss format."
    },
    "top_bottom_infill_wall_overlap": {
      "type": "percent",
      "label": "Top/Bottom solid infill/wall overlap",
      "category": "Strength",
      "tooltip": "Top solid infill area is enlarged slightly to overlap with wall for better bonding and to minimize the appearance of pinholes where the top infill meets the walls. A value of 25-30% is a good starting point, minimizing the appearance of pinholes. The percentage value is relative to line width of sparse infill.",
      "default": "25",
      "wiki_page": "strength_settings_top_bottom_shells#infillwall-overlap"
    },
    "top_one_wall_type": {
      "wiki_page": "quality_settings_wall_and_surfaces#only-one-wall"
    },
    "top_shell_layers": {
      "type": "int",
      "label": "Top shell layers",
      "full_label": "Top solid layers",
      "category": "Strength",
      "sidetext": "layers",
      "tooltip": "This is the number of solid layers of top shell, including the top surface layer. When the thickness calculated by this value is thinner than top shell thickness, the top shell layers will be increased.",
      "default": "4",
      "wiki_page": "strength_settings_top_bottom_shells#shell-layers"
    },
    "top_shell_thickness": {
      "type": "float",
      "label": "Top shell thickness",
      "full_label": "Top shell thickness",
      "category": "Strength",
      "sidetext": "mm",
      "tooltip": "The number of top solid layers is increased when slicing if the thickness calculated by top shell layers is thinner than this value. This can avoid having too thin shell when layer height is small. 0 means that this setting is disabled and thickness of top shell is absolutely determined by top shell layers.",
      "default": "0.6",
      "wiki_page": "strength_settings_top_bottom_shells#shell-thickness"
    },
    "top_solid_infill_flow_ratio": {
      "type": "float",
      "label": "Top surface flow ratio",
      "category": "Advanced",
      "tooltip": "This factor affects the amount of material for top solid infill. You can decrease it slightly to have smooth surface finish.\n\nThe actual top surface flow used is calculated by multiplying this value with the filament flow ratio, and if set, the object's flow ratio.",
      "default": "1",
      "wiki_page": "quality_settings_wall_and_surfaces#surface-flow-ratio"
    },
    "top_surface_acceleration": {
      "type": "float",
      "label": "Top surface",
      "category": "Speed",
      "tooltip": "Acceleration of top surface infill. Using a lower value may improve top surface quality.",
      "default": "500",
      "wiki_page": "speed_settings_acceleration#top-surface"
    },
    "top_surface_density": {
      "type": "percent",
      "label": "Top surface density",
      "category": "Strength",
      "tooltip": "Density of top surface layer. A value of 100% creates a fully solid, smooth top layer. Reducing this value results in a textured top surface, according to the chosen top surface pattern. A value of 0% will result in only the walls on the top layer being created. Intended for aesthetic or functional purposes, not to fix issues such as over-extrusion.",
      "default": "100",
      "wiki_page": "strength_settings_top_bottom_shells#surface-density"
    },
    "top_surface_jerk": {
      "type": "float",
      "label": "Top surface",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Jerk for top surface.",
      "default": "9",
      "wiki_page": "speed_settings_jerk_xy#top-surface"
    },
    "top_surface_line_width": {
      "type": "coFloatOrPercent",
      "label": "Top surface",
      "category": "Quality",
      "sidetext": "mm or %",
      "tooltip": "Line width for top surfaces. If expressed as a %, it will be computed over the nozzle diameter.",
      "wiki_page": "quality_settings_line_width"
    },
    "top_surface_pattern": {
      "type": "enum",
      "label": "Top surface pattern",
      "category": "Strength",
      "tooltip": "Line pattern of top surface infill.",
      "wiki_page": "strength_settings_top_bottom_shells#surface-pattern"
    },
    "top_surface_speed": {
      "type": "float",
      "label": "Top surface",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Speed of top surface infill which is solid.",
      "default": "100",
      "wiki_page": "speed_settings_other_layers_speed#top-surface"
    },
    "total_cost": {
      "type": "float",
      "label": "Total cost",
      "tooltip": "Total cost of all material used in the print. Calculated from filament_cost value in Filament Settings."
    },
    "total_layer_count": {
      "type": "int",
      "label": "Total layer count",
      "tooltip": "Number of layers in the entire print."
    },
    "total_toolchanges": {
      "type": "int",
      "label": "Total tool changes",
      "tooltip": "Number of tool changes during the print."
    },
    "total_weight": {
      "type": "float",
      "label": "Total weight",
      "tooltip": "Total weight of the print. Calculated from filament_density value in Filament Settings."
    },
    "total_wipe_tower_cost": {
      "type": "float",
      "label": "Total wipe tower cost",
      "tooltip": "Total cost of the material wasted on the wipe tower. Calculated from filament_cost value in Filament Settings."
    },
    "total_wipe_tower_filament": {
      "type": "float",
      "label": "Wipe tower volume",
      "tooltip": "Total filament volume extruded on the wipe tower."
    },
    "travel_acceleration": {
      "type": "float",
      "label": "Travel",
      "category": "Speed",
      "tooltip": "Acceleration of travel moves.",
      "default": "10000",
      "wiki_page": "speed_settings_acceleration#travel"
    },
    "travel_jerk": {
      "type": "float",
      "label": "Travel",
      "category": "Speed",
      "sidetext": "mm/s",
      "tooltip": "Jerk for travel.",
      "default": "12",
      "wiki_page": "speed_settings_jerk_xy#travel"
    },
    "travel_slope": {
      "type": "float",
      "label": "Traveling angle",
      "tooltip": "Traveling angle for Slope and Spiral Z-hop type. Setting it to 90° results in Normal Lift.",
      "wiki_page": "printer_extruder_z_hop#traveling-angle"
    },
    "travel_speed": {
      "type": "float",
      "label": "Travel",
      "sidetext": "mm/s",
      "tooltip": "Speed of travel which is faster and without extrusion.",
      "default": "120",
      "wiki_page": "speed_settings_travel"
    },
    "travel_speed_z": {
      "type": "float",
      "label": "Z travel",
      "sidetext": "mm/s",
      "tooltip": "Speed of vertical travel along z axis. This is typically lower because build plate or gantry is hard to be moved. Zero means using travel speed directly in G-code, but will be limited by printer's ability when run G-code.",
      "default": "0.0"
    },
    "tree_support_angle_slow": {
      "type": "float",
      "label": "Preferred Branch Angle",
      "category": "Support",
      "tooltip": "The preferred angle of the branches, when they do not have to avoid the model. Use a lower angle to make them more vertical and more stable. Use a higher angle for branches to merge faster.",
      "default": "25",
      "wiki_page": "support_settings_tree#preferred-branch-angle"
    },
    "tree_support_auto_brim": {
      "type": "bool",
      "label": "Auto brim width",
      "category": "Quality",
      "tooltip": "Enabling this option means the width of the brim for tree support will be automatically calculated.",
      "default": "1",
      "wiki_page": "support_settings_tree"
    },
    "tree_support_branch_angle": {
      "type": "float",
      "label": "Tree support branch angle",
      "category": "Support",
      "tooltip": "This setting determines the maximum overhang angle that the branches of tree support are allowed to make. If the angle is increased, the branches can be printed more horizontally, allowing them to reach farther.",
      "default": "40.0",
      "wiki_page": "support_settings_tree#branch-angle"
    },
    "tree_support_branch_angle_organic": {
      "type": "float",
      "label": "Tree support branch angle",
      "category": "Support",
      "tooltip": "This setting determines the maximum overhang angle that the branches of tree support are allowed to make. If the angle is increased, the branches can be printed more horizontally, allowing them to reach farther.",
      "default": "40.0",
      "wiki_page": "support_settings_tree#branch-angle"
    },
    "tree_support_branch_diameter": {
      "type": "float",
      "label": "Tree support branch diameter",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "This setting determines the initial diameter of support nodes.",
      "default": "5.0",
      "wiki_page": "support_settings_tree#branch-diameter"
    },
    "tree_support_branch_diameter_angle": {
      "type": "float",
      "label": "Branch Diameter Angle",
      "category": "Support",
      "tooltip": "The angle of the branches' diameter as they gradually become thicker towards the bottom. An angle of 0 will cause the branches to have uniform thickness over their length. A bit of an angle can increase stability of the organic support.",
      "default": "5",
      "wiki_page": "support_settings_tree#branch-diameter-angle"
    },
    "tree_support_branch_diameter_organic": {
      "type": "float",
      "label": "Tree support branch diameter",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "This setting determines the initial diameter of support nodes.",
      "default": "2.0",
      "wiki_page": "support_settings_tree#branch-diameter"
    },
    "tree_support_branch_distance": {
      "type": "float",
      "label": "Tree support branch distance",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "This setting determines the distance between neighboring tree support nodes.",
      "default": "5.0",
      "wiki_page": "support_settings_tree#branch-distance"
    },
    "tree_support_branch_distance_organic": {
      "type": "float",
      "label": "Tree support branch distance",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "This setting determines the distance between neighboring tree support nodes.",
      "default": "1.0",
      "wiki_page": "support_settings_tree#branch-distance"
    },
    "tree_support_brim_width": {
      "type": "float",
      "label": "Tree support brim width",
      "category": "Quality",
      "tooltip": "Distance from tree branch to the outermost brim line.",
      "default": "3",
      "wiki_page": "support_settings_tree"
    },
    "tree_support_tip_diameter": {
      "type": "float",
      "label": "Tip Diameter",
      "category": "Support",
      "sidetext": "mm",
      "tooltip": "Branch tip diameter for organic supports.",
      "default": "0.8",
      "wiki_page": "support_settings_tree#tip-diameter"
    },
    "tree_support_top_rate": {
      "type": "percent",
      "label": "Branch Density",
      "category": "Support",
      "tooltip": "Adjusts the density of the support structure used to generate the tips of the branches. A higher value results in better overhangs but the supports are harder to remove, thus it is recommended to enable top support interfaces instead of a high branch density value if dense interfaces are needed.",
      "default": "30",
      "wiki_page": "support_settings_tree#branch-density"
    },
    "tree_support_wall_count": {
      "type": "int",
      "label": "Support wall loops",
      "category": "Support",
      "tooltip": "This setting specifies the count of support walls in the range of [0,2]. 0 means auto.",
      "default": "0",
      "wiki_page": "support_settings_advanced#support-wall-loops"
    },
    "tree_support_with_infill": {
      "type": "bool",
      "label": "Tree support with infill",
      "category": "Support",
      "tooltip": "This setting specifies whether to add infill inside large hollows of tree support.",
      "default": "false"
    },
    "uptodate": {
      "type": "bool",
      "label": "UpToDate",
      "tooltip": "Update the config values of 3MF to latest.",
      "default": "false"
    },
    "uptodate_filaments": {
      "type": "string",
      "label": "Load uptodate filament settings when using uptodate",
      "tooltip": "Load uptodate filament settings from the specified file when using uptodate."
    },
    "uptodate_settings": {
      "type": "string",
      "label": "Load uptodate process/machine settings when using uptodate",
      "tooltip": "Load uptodate process/machine settings from the specified file when using uptodate."
    },
    "upward_compatible_machine": {
      "type": "string",
      "label": "upward compatible machine"
    },
    "use_firmware_retraction": {
      "type": "bool",
      "label": "Use firmware retraction",
      "tooltip": "This experimental setting uses G10 and G11 commands to have the firmware handle the retraction. This is only supported in recent Marlin.",
      "default": "false",
      "wiki_page": "printer_basic_information_advanced#use-firmware-retraction"
    },
    "use_relative_e_distances": {
      "type": "bool",
      "label": "Use relative E distances",
      "tooltip": "Relative extrusion is recommended when using \"label_objects\" option. Some extruders work better with this option unchecked (absolute extrusion mode). Wipe tower is only compatible with relative mode. It is recommended on most printers. Default is checked.",
      "default": "true",
      "wiki_page": "printer_basic_information_advanced#use-relative-e-distances"
    },
    "used_filament": {
      "type": "float",
      "label": "Used filament",
      "tooltip": "Total length of filament used in the print."
    },
    "used_filament_length": {
      "type": "string",
      "label": "Filament length (meters)",
      "tooltip": "Total filament length used in meters. Replaced with actual value during post-processing."
    },
    "volumetric_speed_coefficients": {
      "type": "string",
      "label": "Max volumetric speed multinomial coefficients"
    },
    "wall_direction": {
      "type": "enum",
      "label": "Wall loop direction",
      "category": "Quality",
      "tooltip": "The direction which the wall loops are extruded when looking down from the top.\n\nBy default all walls are extruded in counter-clockwise, unless Reverse on even is enabled. Set this to any option other than Auto will force the wall direction regardless of the Reverse on even.\n\nThis option will be disabled if spiral vase mode is enabled.",
      "wiki_page": "quality_settings_wall_and_surfaces#wall-loop-direction"
    },
    "wall_distribution_count": {
      "type": "int",
      "label": "Wall distribution count",
      "category": "Quality",
      "tooltip": "The number of walls, counted from the center, over which the variation needs to be spread. Lower values mean that the outer walls don't change in width.",
      "default": "1",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "wall_filament": {
      "type": "int",
      "label": "Walls",
      "category": "Extruders",
      "tooltip": "Filament to print walls.",
      "default": "1",
      "wiki_page": "multimaterial_settings_filament_for_features#walls"
    },
    "wall_generator": {
      "type": "enum",
      "label": "Wall generator",
      "category": "Quality",
      "tooltip": "Classic wall generator produces walls with constant extrusion width and for very thin areas is used gap-fill. Arachne engine produces walls with variable extrusion width.",
      "wiki_page": "quality_settings_wall_generator"
    },
    "wall_loops": {
      "type": "int",
      "label": "Wall loops",
      "category": "Strength",
      "tooltip": "Number of walls of every layer.",
      "default": "2",
      "wiki_page": "strength_settings_walls#wall-loops"
    },
    "wall_sequence": {
      "type": "enum",
      "label": "Walls printing order",
      "category": "Quality",
      "tooltip": "Print sequence of the internal (inner) and external (outer) walls.\n\nUse Inner/Outer for best overhangs. This is because the overhanging walls can adhere to a neighbouring perimeter while printing. However, this option results in slightly reduced surface quality as the external perimeter is deformed by being squashed to the internal perimeter.\n\nUse Inner/Outer/Inner for the best external surface finish and dimensional accuracy as the external wall is printed undisturbed from an internal perimeter. However, overhang performance will reduce as there is no internal perimeter to print the external wall against. This option requires a minimum of 3 walls to be effective as it prints the internal walls from the 3rd perimeter onwards first, then the external perimeter and, finally, the first internal perimeter. This option is recommended against the Outer/Inner option in most cases.\n\nUse Outer/Inner for the same external wall quality and dimensional accuracy benefits of Inner/Outer/Inner option. However, the Z seams will appear less consistent as the first extrusion of a new layer starts on a visible surface.",
      "wiki_page": "quality_settings_wall_and_surfaces#walls-printing-order"
    },
    "wall_transition_angle": {
      "type": "float",
      "label": "Wall transitioning threshold angle",
      "category": "Quality",
      "tooltip": "When to create transitions between even and odd numbers of walls. A wedge shape with an angle greater than this setting will not have transitions and no walls will be printed in the center to fill the remaining space. Reducing this setting reduces the number and length of these center walls, but may leave gaps or overextrude.",
      "default": "10.0",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "wall_transition_filter_deviation": {
      "type": "percent",
      "label": "Wall transitioning filter margin",
      "category": "Quality",
      "tooltip": "Prevent transitioning back and forth between one extra wall and one less. This margin extends the range of extrusion widths which follow to [Minimum wall width - margin, 2 * Minimum wall width + margin]. Increasing this margin reduces the number of transitions, which reduces the number of extrusion starts/stops and travel time. However, large extrusion width variation can lead to under- or overextrusion problems. It's expressed as a percentage over nozzle diameter.",
      "default": "25",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "wall_transition_length": {
      "type": "percent",
      "label": "Wall transition length",
      "category": "Quality",
      "tooltip": "When transitioning between different numbers of walls as the part becomes thinner, a certain amount of space is allotted to split or join the wall segments. It's expressed as a percentage over nozzle diameter.",
      "default": "100",
      "wiki_page": "quality_settings_wall_generator#arachne"
    },
    "wipe": {
      "type": "bool",
      "label": "Wipe while retracting",
      "tooltip": "Move nozzle along the last extrusion path when retracting to clean any leaked material on the nozzle. This can minimize blobs when printing a new part after traveling.",
      "wiki_page": "printer_extruder_retraction#wipe-while-retracting"
    },
    "wipe_before_external_loop": {
      "type": "bool",
      "label": "Wipe before external loop",
      "category": "Quality",
      "tooltip": "To minimize visibility of potential overextrusion at the start of an external perimeter when printing with Outer/Inner or Inner/Outer/Inner wall print order, the de-retraction is performed slightly on the inside from the start of the external perimeter. That way any potential over extrusion is hidden from the outside surface.\n\nThis is useful when printing with Outer/Inner or Inner/Outer/Inner wall print order as in these modes it is more likely an external perimeter is printed immediately after a de-retraction move.",
      "default": "false",
      "wiki_page": "quality_settings_seam#wipe-before-external"
    },
    "wipe_distance": {
      "type": "float",
      "label": "Wipe Distance",
      "sidetext": "mm",
      "tooltip": "Describe how long the nozzle will move along the last path when retracting.\n\nDepending on how long the wipe operation lasts, how fast and long the extruder/filament retraction settings are, a retraction move may be needed to retract the remaining filament.\n\nSetting a value in the retract amount before wipe setting below will perform any excess retraction before the wipe, else it will be performed after.",
      "wiki_page": "printer_extruder_retraction#wipe-distance"
    },
    "wipe_on_loops": {
      "type": "bool",
      "label": "Wipe on loops",
      "category": "Quality",
      "tooltip": "To minimize the visibility of the seam in a closed loop extrusion, a small inward movement is executed before the extruder leaves the loop.",
      "default": "false",
      "wiki_page": "quality_settings_seam#wipe-on-loop-inward-movement"
    },
    "wipe_speed": {
      "type": "coFloatOrPercent",
      "label": "Wipe speed",
      "category": "Speed",
      "sidetext": "mm/s or %",
      "tooltip": "The wipe speed is determined by the speed setting specified in this configuration. If the value is expressed as a percentage (e.g. 80%), it will be calculated based on the travel speed setting above. The default value for this parameter is 80%.",
      "wiki_page": "quality_settings_seam#wipe-speed"
    },
    "wipe_tower_bridging": {
      "type": "float",
      "label": "Maximal bridging distance",
      "sidetext": "mm",
      "tooltip": "Maximal distance between supports on sparse infill sections.",
      "default": "10.0",
      "wiki_page": "multimaterial_settings_prime_tower#maximal-bridging-distance"
    },
    "wipe_tower_cone_angle": {
      "type": "float",
      "label": "Stabilization cone apex angle",
      "tooltip": "Angle at the apex of the cone that is used to stabilize the wipe tower. Larger angle means wider base.",
      "default": "30.0",
      "wiki_page": "multimaterial_settings_prime_tower#stabilization-cone-apex-angle"
    },
    "wipe_tower_extra_flow": {
      "type": "percent",
      "label": "Extra flow for purging",
      "tooltip": "Extra flow used for the purging lines on the wipe tower. This makes the purging lines thicker or narrower than they normally would be. The spacing is adjusted automatically.",
      "default": "100.0",
      "wiki_page": "multimaterial_settings_prime_tower#extra-flow-for-purge"
    },
    "wipe_tower_extra_rib_length": {
      "type": "float",
      "label": "Extra rib length",
      "sidetext": "mm",
      "tooltip": "Positive values can increase the size of the rib wall, while negative values can reduce the size. However, the size of the rib wall can not be smaller than that determined by the cleaning volume.",
      "default": "0",
      "wiki_page": "multimaterial_settings_prime_tower#extra-rib-length"
    },
    "wipe_tower_extra_spacing": {
      "type": "percent",
      "label": "Wipe tower purge lines spacing",
      "tooltip": "Spacing of purge lines on the wipe tower.",
      "default": "100.0",
      "wiki_page": "multimaterial_settings_prime_tower#wipe-tower-purge-lines-spacing"
    },
    "wipe_tower_filament": {
      "type": "int",
      "label": "Wipe tower",
      "category": "Extruders",
      "tooltip": "The extruder to use when printing perimeter of the wipe tower. Set to 0 to use the one that is available (non-soluble would be preferred).",
      "default": "0",
      "wiki_page": "multimaterial_settings_filament_for_features#wipe-tower"
    },
    "wipe_tower_fillet_wall": {
      "type": "bool",
      "label": "Fillet wall",
      "tooltip": "The wall of prime tower will fillet.",
      "default": "true",
      "wiki_page": "multimaterial_settings_prime_tower#fillet-wall"
    },
    "wipe_tower_max_purge_speed": {
      "type": "float",
      "label": "Maximum wipe tower print speed",
      "sidetext": "mm/s",
      "tooltip": "The maximum print speed when purging in the wipe tower and printing the wipe tower sparse layers. When purging, if the sparse infill speed or calculated speed from the filament max volumetric speed is lower, the lowest will be used instead.\n\nWhen printing the sparse layers, if the internal perimeter speed or calculated speed from the filament max volumetric speed is lower, the lowest will be used instead.\n\nIncreasing this speed may affect the tower's stability as well as increase the force with which the nozzle collides with any blobs that may have formed on the wipe tower.\n\nBefore increasing this parameter beyond the default of 90 mm/s, make sure your printer can reliably bridge at the increased speeds and that ooze when tool changing is well controlled.\n\nFor the wipe tower external perimeters the internal perimeter speed is used regardless of this setting.",
      "default": "90.0",
      "wiki_page": "multimaterial_settings_prime_tower#maximum-wipe-tower-print-speed"
    },
    "wipe_tower_no_sparse_layers": {
      "type": "bool",
      "label": "No sparse layers (beta)",
      "tooltip": "If enabled, the wipe tower will not be printed on layers with no tool changes. On layers with a tool change, extruder will travel downward to print the wipe tower. User is responsible for ensuring there is no collision with the print.",
      "default": "false",
      "wiki_page": "multimaterial_settings_prime_tower#no-sparse-layers"
    },
    "wipe_tower_rib_width": {
      "type": "float",
      "label": "Rib width",
      "sidetext": "mm",
      "tooltip": "Rib width is always less than half the prime tower side length.",
      "default": "8",
      "wiki_page": "multimaterial_settings_prime_tower#rib-width"
    },
    "wipe_tower_rotation_angle": {
      "type": "float",
      "label": "Wipe tower rotation angle",
      "tooltip": "Wipe tower rotation angle with respect to X axis.",
      "default": "0.0",
      "wiki_page": "multimaterial_settings_prime_tower#wipe-tower-rotation-angle"
    },
    "wipe_tower_wall_type": {
      "type": "enum",
      "label": "Wall type",
      "tooltip": "Wipe tower outer wall type.\n1. Rectangle: The default wall type, a rectangle with fixed width and height.\n2. Cone: A cone with a fillet at the bottom to help stabilize the wipe tower.\n3. Rib: Adds four ribs to the tower wall for enhanced stability.",
      "wiki_page": "multimaterial_settings_prime_tower#wall-type"
    },
    "wipe_tower_x": {
      "type": "float",
      "label": "Position X",
      "sidetext": "mm",
      "tooltip": "X coordinate of the left front corner of a wipe tower."
    },
    "wipe_tower_y": {
      "type": "float",
      "label": "Position Y",
      "sidetext": "mm",
      "tooltip": "Y coordinate of the left front corner of a wipe tower."
    },
    "wiping_volumes_extruders": {
      "type": "float",
      "label": "Purging volumes - load/unload volumes",
      "tooltip": "This vector saves required volumes to change from/to each tool used on the wipe tower. These values are used to simplify creation of the full purging volumes below."
    },
    "wrapping_detection_gcode": {
      "type": "string",
      "label": "Clumping detection G-code"
    },
    "wrapping_detection_layers": {
      "type": "int",
      "label": "Clumping detection layers",
      "tooltip": "Clumping detection layers.",
      "default": "20"
    },
    "wrapping_exclude_area": {
      "type": "points",
      "label": "Probing exclude area of clumping",
      "tooltip": "Probing exclude area of clumping."
    },
    "xy_contour_compensation": {
      "type": "float",
      "label": "X-Y contour compensation",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Contours of objects will expand or contract in the XY plane by the configured value. Positive values make contours bigger, negative values make contours smaller. This function is used to adjust sizes slightly when the objects have assembling issues.",
      "default": "0",
      "wiki_page": "quality_settings_precision#x-y-compensation"
    },
    "xy_hole_compensation": {
      "type": "float",
      "label": "X-Y hole compensation",
      "category": "Quality",
      "sidetext": "mm",
      "tooltip": "Holes in objects will expand or contract in the XY plane by the configured value. Positive values make holes bigger, negative values make holes smaller. This function is used to adjust sizes slightly when the objects have assembling issues.",
      "default": "0",
      "wiki_page": "quality_settings_precision#x-y-compensation"
    },
    "year": {
      "type": "int",
      "label": "Year"
    },
    "z_hop": {
      "type": "float",
      "label": "Z-hop height",
      "sidetext": "mm",
      "tooltip": "Whenever the retraction is done, the nozzle is lifted a little to create clearance between nozzle and the print. It prevents nozzle from hitting the print when travel move. Using spiral lines to lift Z can prevent stringing.",
      "wiki_page": "printer_extruder_z_hop#z-hop-height"
    },
    "z_hop_types": {
      "type": "coEnums",
      "label": "Z-hop type",
      "tooltip": "Type of Z-hop.",
      "wiki_page": "printer_extruder_z_hop#z-hop-type"
    },
    "z_offset": {
      "type": "float",
      "label": "Z offset",
      "sidetext": "mm",
      "tooltip": "This value will be added (or subtracted) from all the Z coordinates in the output G-code. It is used to compensate for bad Z endstop position: for example, if your endstop zero actually leaves the nozzle 0.3mm far from the print bed, set this to -0.3 (or fix your endstop).",
      "default": "0",
      "wiki_page": "printer_basic_information_printable_space#z-offset"
    },
    "zhop": {
      "type": "float",
      "label": "Current Z-hop",
      "tooltip": "Contains Z-hop present at the beginning of the custom G-code block."
    }
  }
}